 List fillingquestions = [
   
  {
    "section" : 1,
    "question": [
      {"b":"عَنْ أَمِيرِ المُؤمِنينَ أَبي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ قَالَ : سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ : ( إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ ، وَإنَّمَا لِكُلِّ امْرِىءٍ",
       "a":"فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله فَهِجْرتُهُ إلى اللهِ وَرَسُوُله ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا",
       },
      {"b":"",
       "a": "أَو امْرأَةٍ",
        },
      {"b":"",
        "a": "",
        },
      {"b": "فَهِجْرَتُهُ",
        "a": ")",
        }
    ],
    "choises":  [
      "يَنْكِحُهَا ",
      "مَا نَوَى",
      "إِلى مَا هَاجَرَ إلَيْهِ",
      "يُصِيْبُهَا ",    
      ],
     "answers":  [
      "مَا نَوَى",
      "يُصِيْبُهَا ",
      "يَنْكِحُهَا ",
      "إِلى مَا هَاجَرَ إلَيْهِ",
          
      ],
      },
      {
    "section" : 1,
    "question": [
      {"b":"قَالَ فَأخْبِرْنِيْ عَنِ الإِحْسَانِ، قَالَ:  أَنْ",
       "a":"",
       },
      {"b" : "كَأَنَكَ تَرَاهُ، فَإِنْ لمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاك. قَالَ: فَأَخْبِرْنِي عَنِ السَّاعَةِ ، قَالَ : مَا الْمَسئُوُلُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ.  قَالَ : فَأخْبِرْنِيْ عَنْ",
       "a": "",
        },
      {"b":"قَالَ :  أَنْ تَلِدَ الأَمَةُ رَبَّتَهَا ، وَأَنْ تَرى",
        "a": "",
        },
      {"b": "العُرَاةَ العَالَةَ رِعَاءَ الشَّاءِ",
        "a": "فِي البُنْيَانِ",
        }
    ],
    "choises":  [
      "الحُفَاةَ ",
      "تَعْبُدَ اللهَ",
      "أَمَارَتِها ",
      "يَتَطَاوَلُوْنَ ",    
      ],
     "answers":  [
      "تَعْبُدَ اللهَ",
      "أَمَارَتِها ",
      "الحُفَاةَ ",
      "يَتَطَاوَلُوْنَ ",
          
      ],
      },
       {
    "section" : 1,
    "question": [
      {"b":"عَنْ أَبِيْ عَبْدِ الرَّحْمَنِ عَبْدِ اللهِ بْنِ عُمَرَ بْن الخَطَّابِ رَضِيَ اللهُ عَنْهُمَا قَالَ: سَمِعْتُ رسول الله ﷺ يَقُوْلُ:",
       "a":"",
       },
      {"b":"الإِسْلامُ عَلَى خَمْسٍ:",
       "a": "",
        },
      {"b":"أَنْ لاَ إِلَهَ إِلاَّ الله وَأَنَّ مُحَمَّدَاً رَسُوْلُ اللهِ، وَإِقَامِ الصَّلاةِ، وَ",
        "a": "",
        },
      {"b": " الزَّكَاةِ، وَحَجِّ البِيْتِ، وَ",
        "a": "رَمَضَانَ ",
        }
    ],
    "choises":  [
      "شَهَادَةِ ",
      "صَوْمِ",
      "إِيْتَاءِ",
      "بُنِيَ ",    
      ],
     "answers":  [
      "بُنِيَ ",
      "شَهَادَةِ ",
      "إِيْتَاءِ",
      "صَوْمِ",
          
      ],
      },
       {
    "section" : 1,
    "question": [
      {"b":"عَنْ أبي عبد الرحمن عَبْدِ اللهِ بنِ مَسْعُوْدْ رَضِيَ اللهُ عَنْهُ قَالَ: حَدَّثَنَا رَسُوْلُ اللهِ ﷺ وَهُوَ الصَّادِقُ المَصْدُوْقُ : إِنَّ أَحَدَكُمْ",
       "a":"",
       },
      {"b":"فِيْ بَطْنِ أُمِّهِ أَرْبَعِيْنَ يَوْمَاً،  ثُمَّ يَكُوْنُ",
       "a": "",
        },
      {"b":"مِثْلَ ذَلِكَ،ثُمَّ يَكُوْنُ ",
        "a": "",
        },
      {"b": "مِثْلَ ذَلِكَ،ثُمَّ يُرْسَلُ إِلَيْهِ المَلَكُ فَيَنفُخُ فِيْهِ الرٌّوْحَ،وَ",
        "a": "بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ وَأَجَلِهِ وَعَمَلِهِ وَشَقِيٌّ أَوْ سَعِيْدٌ.",
        }
    ],
    "choises":  [
      "يُجْمَعُ خَلْقُهُ",
      "يَؤْمَرُ",
      "عَلَقَةً ",
      "مُضْغَةً ",    
      ],
     "answers":  [
      "يُجْمَعُ خَلْقُهُ",
      "عَلَقَةً ",
      "مُضْغَةً ",
      "يَؤْمَرُ",
          
      ],
      },
       {
    "section" : 1,
    "question": [
      {"b":"فَوَالله الَّذِي لاَ إِلَهَ غَيْرُهُ إِنََّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ",
       "a":"",
       },
      {"b":"حَتَّى مَا يَكُوْنُ بَيْنَهُ وَبَيْنَهَا إلاذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ",
       "a": "",
        },
      {"b":"فَيَدْخُلُهَا، وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ",
        "a": "",
        },
      {"b": "حَتَّى مَايَكُونُ بَيْنَهُ وَبَيْنَهَا إلا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ",
        "a": "فَيَدْخُلُهَا",
        }
    ],
    "choises":  [
      "الجَنَّةِ ",
      "الجَنَّةِ ",
      "النَّارِ ",
      "النَّارِ ",    
      ],
     "answers":  [
      "الجَنَّةِ ",
      "النَّارِ ",
      "النَّارِ ",
      "الجَنَّةِ ",
          
      ],
      },
       {
    "section" : 1,
    "question": [
      {"b":"عَنْ أُمِّ المُؤمِنِينَ أُمِّ عَبْدِ اللهِ عَائِشَةَ - رَضِيَ اللهُ عَنْهَا - قَالَتْ: قَالَ رَسُوْلُ اللهِ :  مَنْ",
       "a":"",
       },
      {"b":"فِيْ",
       "a": "",
        },
      {"b":"هَذَا مَا",
        "a": "",
        },
      {"b": "مِنْهُ فَهُوَ",
        "a": "",
        }
    ],
    "choises":  [
      "أَحْدَثَ ",
      "لَيْسَ ",
      "أَمْرِنَا ",
      "رَدٌّ ",    
      ],
     "answers":  [
      "أَحْدَثَ ",
      "أَمْرِنَا ",
      "لَيْسَ ",
      "رَدٌّ ",
          
      ],
      },
       {
    "section" : 1,
    "question": [
      {"b":"عَنْ أَبِيْ عَبْدِ اللهِ النُّعْمَانِ بْنِ بِشِيْر رضي الله عنهما قَالَ: سَمِعْتُ رَسُوْلَ اللهِ ﷺ يَقُوْلُ: (إِنَّ الحَلالَ بَيِّنٌ وَإِنَّ الحَرَامَ بَيِّنٌ وَبَيْنَهُمَا  مُشْتَبِهَات لاَ يَعْلَمُهُنَّ كَثِيْرٌ مِنَ النَّاس،ِ فَمَنِ",
       "a":"",
       },
      {"b":"الشُّبُهَاتِ فَقَدِ",
       "a": "",
        },
      {"b":"لِدِيْنِهِ وعِرْضِه، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الحَرَامِ كَالرَّاعِي يَرْعَى حَوْلَ",
        "a": "",
        },
      {"b": "يُوشِكُ أَنْ يَرْتَعَ فِيْهِ. أَلا وَإِنَّ لِكُلِّ مَلِكٍ حِمَىً . أَلا وَإِنَّ حِمَى اللهِ",
        "a": "، أَلا وإِنَّ فِي الجَسَدِ مُضْغَةً إِذَا صَلَحَتْ صَلَحَ الجَسَدُ كُلُّهُ وإذَا فَسَدَت فَسَدَ الجَسَدُ كُلُّهُ أَلا وَهيَ القَلْبُ)",
        }
    ],
    "choises":  [
      "اسْتَبْرأَ ",
      "اتَّقَى ",
      "مَحَارِمُهُ",
      "الحِمَى ",    
      ],
     "answers":  [
      "اتَّقَى ",
      "اسْتَبْرأَ ",
      "الحِمَى ",
      "مَحَارِمُهُ",
          
      ],
      },
       {
    "section" : 1,
    "question": [
      {"b":"عَنْ أَبِيْ رُقَيَّةَ تَمِيْم بْنِ أَوْسٍ الدَّارِيِّ رضي الله عنه أَنَّ النبي ﷺ قَالَ:( الدِّيْنُ النَّصِيْحَةُ قُلْنَا: لِمَنْ ؟ قَالَ:",
       "a":"",
       },
      {"b":"و",
       "a": "",
        },
      {"b":"و",
        "a": "",
        },
      {"b": "و",
        "a": "، وَعَامَّتِهِمْ",
        }
    ],
    "choises":  [
      "لأَئِمَّةِ المُسْلِمِيْنَ",
      "لكتابه",
      "لِرَسُوْلِهِ",
      "للهِ",    
      ],
     "answers":  [
      "للهِ",
      "لكتابه",
      "لِرَسُوْلِهِ",
      "لأَئِمَّةِ المُسْلِمِيْنَ",
          
      ],
      },
       {
    "section" : 1,
    "question": [
      {"b":"عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا أَنَّ رَسُوْلَ اللهِ قَالَ: (أُمِرْتُ أَنْ",
       "a":"",
       },
      {"b":"النَّاسَ حَتَّى يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللهُ وَأَنَّ مُحَمَّدَاً رَسُوْلُ اللهِ وَيُقِيْمُوْا الصَّلاةَ وَيُؤْتُوا الزَّكَاةَ فَإِذَا فَعَلُوا ذَلِكَ",
       "a": "",
        },
      {"b":"مِنِّي",
        "a": "",
        },
      {"b": "وَ",
        "a": "إِلاَّ بِحَقِّ الإِسْلامِ وَحِسَابُهُمْ عَلَى اللهِ تَعَالَى)",
        }
    ],
    "choises":  [
      "أُقَاتِلَ ",
      "دِمَاءهَمْ ",
      "أَمْوَالَهُمْ",
      "عَصَمُوا ",    
      ],
     "answers":  [
      "أُقَاتِلَ ",
      "عَصَمُوا ",
      "دِمَاءهَمْ ",
      "أَمْوَالَهُمْ",
 
      ],
      },
       {
    "section" : 1,
    "question": [
      {"b":"عَنْ أَبِي هُرَيْرَةَ عَبْدِ الرَّحْمَنِ بْنِ صَخْرٍ رَضِيَ الله تَعَالَى عَنْهُ قَالَ: سَمِعْتُ رَسُوْلَ اللهِ ﷺ يَقُوْلُ: (مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ وَمَا أَمَرْتُكُمْ بِهِ فأْتُوا مِنْهُ",
       "a":"",
       },
      {"b":"فَإِنَّمَا",
       "a": "",
        },
      {"b":"الَّذِيْنَ مِنْ قَبْلِكُمْ",
        "a": "",
        },
      {"b": "مَسَائِلِهِمْ وَ",
        "a": "عَلَى أَنْبِيَائِهِمْ)",
        }
    ],
    "choises":  [
      "مَا اسْتَطَعْتُمْ",
      "اخْتِلافُهُمْ",
      "كَثْرَةُ ",
      "أَهْلَكَ ",    
      ],
     "answers":  [
      "مَا اسْتَطَعْتُمْ",
      "أَهْلَكَ ",
      "كَثْرَةُ ",
      "اخْتِلافُهُمْ",
          
      ],
      },
       {
    "section" : 1,
    "question": [
      {"b":"عَنْ أَبِيْ هُرَيْرَةَ رَضِيَ اللهُ تَعَالَى عَنْهُ قَالَ: قَالَ رَسُوْلُ اللهِ : (إِنَّ اللهَ تَعَالَى طَيِّبٌ لاَ يَقْبَلُ إِلاَّ طَيِّبَاً وَإِنَّ اللهَ أَمَرَ",
       "a":"",
       },
      {"b":"بِمَا أَمَرَ بِهِ",
       "a": "",
        },
      {"b":"فَقَالَ : (يَا أَيُّهَا الرُّسُلُ كُلُوا مِنَ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحاً) (المؤمنون: الآية51) ، وَقَالَ: (يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ ) (البقرة: الآية172) ثُمَّ ذَكَرَ الرَّجُلَ يُطِيْلُ السَّفَرَ أَشْعَثَ أَغْبَرَ، يَمُدُّ يَدَيْهِ إِلَى السَّمَاء،ِ يَا رَبُّ يَا رَبُّ، وَ",
        "a": "",
        },
      {"b": "حَرَامٌ ،وَ",
        "a": "حَرَامٌ، ومَلْبَسُهُ حَرَامٌ وَغُذِيَ بِالحَرَامِ فَأَنَّى يُسْتَجَابُ لذلك)",
        }
    ],
    "choises":  [
      "المُؤْمِنِيْنَ ",
      "المُرْسَلِيْنَ ",
      "مَشْرَبُهُ",
      "مَطْعَمُهُ",    
      ],
     "answers":  [
      "المُؤْمِنِيْنَ ",
      "المُرْسَلِيْنَ ",
      "مَطْعَمُهُ",
      "مَشْرَبُهُ",
          
      ],
      },
       {
    "section" : 2,
    "question": [
      {"b":"عَنْ أَبِي مُحَمَّدٍ",
       "a":"",
       },
      {"b":"بنِ ",
       "a": "",
        },
      {"b":"بنِ أبِي طالبٍ سِبْطِ رَسُولِ اللهِ ﷺ وَرَيْحَانَتِهِ رَضِيَ اللهُ عَنْهُمَا قَالَ: حَفِظْتَ مِنْ رَسُوْلِ اللهِ ﷺ : (دَعْ مَا",
        "a": "",
        },
      {"b": "إِلَى مَا",
        "a": "",
        }
    ],
    "choises":  [
      "الحَسَنِ ",
      "عَلِيّ ",
      "يَرِيْبُكَ ",
      "لاَ يَرِيْبُكَ",    
      ],
     "answers":  [
      "الحَسَنِ ",
      "عَلِيّ ",
      "يَرِيْبُكَ ",
      "لاَ يَرِيْبُكَ",
          
      ],
      },
       {
    "section" : 2,
    "question": [
      {"b":"عَنْ أَبِيْ هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُوْلُ اللهِ ﷺ : (مِنْ",
       "a":"",
       },
      {"b":"إِسْلامِ ",
       "a": "",
        },
      {"b":"رْكُهُ مَا لاَ",
        "a": "",
        },

    ],
    "choises":  [
      "يَعْنِيْهِ",
      "حُسْنِ ",
      "المَرْءِ ",
      ],
     "answers":  [
      "حُسْنِ ",
      "المَرْءِ ",
      "يَعْنِيْهِ",
          
      ],
      },
       {
    "section" : 2,
    "question": [
      {"b":"عَنْ أَبِيْ حَمْزَة أَنَسِ بنِ مَالِكٍ رَضِيَ اللهُ تَعَالَى عَنْهُ خَادِمِ رَسُوْلِ اللهِ ﷺ عَن النبي ﷺ قَالَ: (لاَ",
       "a":"",
       },
      {"b":"أَحَدُكُمْ حَتَّى",
       "a": "",
        },
      {"b":"لأَخِيْهِ مَا",
        "a": "لِنَفْسِهِ)",
        },

    ],
    "choises":  [
      "يُحِبُّ ",
      "يُحِبَّ ",
      "يُؤمِنُ ",
      ],
     "answers":  [
      "يُؤمِنُ ",
      "يُحِبَّ ",
      "يُحِبُّ ",
          
      ],
      },
       {
    "section" : 2,
    "question": [
      {"b":"عنِ ابْنِ مَسْعُودٍ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ : (لا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ يشهَدُ أَنْ لا إلهَ إلّا اللهُ وأنّي رسولُ اللهِ إِلاَّ بإِحْدَى ثَلاثٍ:",
       "a":"",
       },
      {"b":"الزَّانِيْ، وَ",
       "a": "",
        },
      {"b":"بِالنَّفْسِ، وَ",
        "a": "",
        },
      {"b": "لِدِيْنِهِ",
        "a": "للجمَاعَةِ)",
        }
    ],
    "choises":  [
      "الثَّيِّبُ ",
      "المُفَارِقُ ",
      "التَّاركُ",
      "النَّفْسُ",    
      ],
     "answers":  [
      "الثَّيِّبُ ",
      "النَّفْسُ",
      "التَّاركُ",
      "المُفَارِقُ ",
          
      ],
      },
      {
    "section" : 2,
    "question": [
      {"b":"عَن أَبِي هُرَيْرَةَ رضي الله عنه أَنَّ رَسُولَ اللهِ ﷺ قَالَ: (مَنْ كَانَ يُؤمِنُ بِاللهِ وَاليَوْمِ الآخِرِ فَلْيَقُلْ",
       "a":"",
       },
      {"b":"أَو",
       "a": "",
        },
      {"b":"وَمَنْ كَانَ يُؤمِنُ بِاللهِ وَاليَومِ الآخِرِ فَلْيُكْرِمْ ",
        "a": "",
        },
      {"b": "وَمَنْ كَانَ يُؤمِنُ بِاللهِ وَاليَومِ الآخِرِ فَلْيُكْرِمْ ",
        "a": "",
        }
    ],
    "choises":  [
      "جَارَهُ",
      "ضَيْفَهُ",
      "لِيَصْمُتْ",
      "خَيْرَاً ",    
      ],
     "answers":  [
      "خَيْرَاً ",
      "لِيَصْمُتْ",
      "جَارَهُ",
      "ضَيْفَهُ",
          
      ],
      },
      {
    "section" : 2,
    "question": [
      {"b":"عَنْ أَبِي يَعْلَى شَدَّادِ بنِ أَوْسٍ رَضِيَ اللهُ تَعَالَى عَنْهُ عَنْ رَسُولِ اللهِ ﷺ قَالَ: (إِنَّ اللهَ كَتَبَ",
       "a":"",
       },
      {"b":"عَلَى كُلِّ شَيءٍ. فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا القِتْلَةَ، وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ، وَلْيُحِدَّ أَحَدُكُمْ",
       "a": "",
        },
      {"b":"وَلْيُرِحْ ",
        "a": "",
        },

    ],
    "choises":  [
      "ذَبِيْحَتَهُ",
      "شَفْرَتَهُ",
      "الإِحْسَانَ ",
      ],
     "answers":  [
      "الإِحْسَانَ ",
      "شَفْرَتَهُ",
      "ذَبِيْحَتَهُ",
          
      ],
      },
      {
    "section" : 2,
    "question": [
      {"b":"عَنْ أَبِيْ ذَرٍّ جُنْدُبِ بنِ جُنَادَةَ وَأَبِي عَبْدِ الرَّحْمَنِ مُعَاذِ بِنِ جَبَلٍ رَضِيَ اللهُ عَنْهُمَا عَنْ رَسُولِ اللهِ ﷺ قَالَ: (اتَّقِ اللهَ",
       "a":"",
       },
      {"b":"وَأَتْبِعِ",
       "a": "",
        },
      {"b":"",
        "a": "",
        },
      {"b": "وَخَالِقِ النَّاسَ",
        "a": "حَسَنٍ )",
        }
    ],
    "choises":  [
      "حَيْثُمَا كُنْتَ",
      "السَّيِّئَةَ ",
      "الحَسَنَةَ ",
      "بِخُلُقٍ ",    
      ],
     "answers":  [
      "حَيْثُمَا كُنْتَ",
      "السَّيِّئَةَ ",
      "الحَسَنَةَ ",
      "بِخُلُقٍ ",
          
      ],
      },
      {
    "section" : 2,
    "question": [
      {"b":"عَنْ أَبِي العَبَّاسٍ عَبْدِ اللهِ بنِ عَبَّاسٍ رضي الله عنهما قَالَ: كُنْتُ خَلْفَ النبي ﷺ يَومَاً فَقَالَ: (اِحفظِ اللهَ تَجٍدْهُ أَمَامَكَ، تَعَرَّفْ إلى اللهِ في الرَّخاءِ يَعرِفْكَ في الشّدةِ، وَاعْلَم أن مَا",
       "a":"",
       },
      {"b":"لَمْ يَكُن",
       "a": "",
        },
      {"b":"وَمَا",
        "a": "",
        },
      {"b": "لَمْ يَكُن",
        "a": "وَاعْلَمْ أنَّ النَّصْرَ مَعَ الصَّبْرِ، وَأَنَّ الفَرَجَ مَعَ الكَربِ، وَأَنَّ مَعَ العُسرِ يُسراً)",
        }
    ],
    "choises":  [
      "لِيُخطِئكَ",
      "أَصَابَكَ ",
      "أَخطأكَ ",
      "لِيُصيبكَ",    
      ],
     "answers":  [
      "أَخطأكَ ",
      "لِيُصيبكَ",
      "أَصَابَكَ ",
      "لِيُخطِئكَ",
          
      ],
      },
      {
    "section" : 2,
    "question": [
      {"b":"عَنْ أَبِي عَبَّاسٍ عَبْدِ اللهِ بنِ عَبَّاسٍ رضي الله عنهما قَالَ: كُنْتُ خَلْفَ النبي ﷺ يَومَاً فَقَالَ: (اِحفظِ اللهَ تَجٍدْهُ أَمَامَكَ، تَعَرَّفْ إلى اللهِ في الرَّخاءِ يَعرِفْكَ في الشّدةِ، وَاعْلَم أن مَا أَخطأكَ لَمْ يَكُن لِيُصيبكَ، وَمَا أَصَابَكَ لَمْ يَكُن لِيُخطِئكَ، وَاعْلَمْ أنَّ",
       "a":"",
       },
      {"b":"مَعَ ",
       "a": "",
        },
      {"b":"وَأَنَّ ",
        "a": "",
        },
      {"b": "مَعَ ",
        "a": "وَأَنَّ مَعَ العُسرِ يُسراً)",
        }
    ],
    "choises":  [
      "الصَّبْرِ",
      "النَّصْرَ ",
      "الفَرَجَ ",
      "الكَربِ",    
      ],
     "answers":  [
      "النَّصْرَ ",
      "الصَّبْرِ",
      "الفَرَجَ ",
      "الكَربِ",
          
      ],
      },
      {
    "section" : 2,
    "question": [
      {"b":"عَنْ أَبيْ مَسْعُوْدٍ عُقبَة بنِ عَمْرٍو الأَنْصَارِيِّ البَدْرِيِّ رضي الله عنه قَالَ: قَالَ رَسُوْلُ اللهِ ﷺ (إِنَّ مِمَّا",
       "a":"",
       },
      {"b":"النَاسُ مِن كَلاَمِ",
       "a": "",
        },
      {"b":"الأُولَى إِذا لَم",
        "a": "",
        },
      {"b": "",
        "a": "مَا شِئتَ",
        }
    ],
    "choises":  [
      "تَسْتَحِ",
      "فاصْنَعْ ",
      "النُّبُوَّةِ ",
      "أَدرَكَ ",    
      ],
     "answers":  [
      "أَدرَكَ ",
      "النُّبُوَّةِ ",
      "تَسْتَحِ",
      "فاصْنَعْ ",
          
      ],
      },
      {
    "section" : 3,
    "question": [
      {"b":"عَنِ أَبيْ عَمْرٍو، وَقِيْلَ،أَبيْ عمْرَةَ سُفْيَانَ بنِ عَبْدِ اللهِ الثَّقَفيِّ رضي الله عنه قَالَ: قُلْتُ يَا رَسُوْلَ اللهِ قُلْ لِيْ فِي",
       "a":"",
       },
      {"b":"قَوْلاً لاَ أَسْأَلُ عَنْهُ أَحَدَاً",
       "a": "",
        },
      {"b":"قَالَ: (قُلْ",
        "a": "",
        },
      {"b": "باللهِ ثُمَّ",
        "a": "",
        }
    ],
    "choises":  [
      "غَيْرَكَ",
      "الإِسْلامِ ",
      "استَقِمْ",
      "آمَنْتُ",    
      ],
     "answers":  [
      "الإِسْلامِ ",
      "غَيْرَكَ",
      "آمَنْتُ",
      "استَقِمْ",
          
      ],
      },
      {
    "section" : 3,
    "question": [
      {"b":"عَنْ أَبيْ عَبْدِ اللهِ جَابِرِ بنِ عَبْدِ اللهِ الأَنْصَارِيِّ رضي الله عنه أَنَّ رَجُلاً سَأَلَ رسولَ اللهِ ﷺ فَقَالَ: (",
       "a":"",
       },
      {"b":"إِذا صَلَّيْتُ",
       "a": "",
        },
      {"b":"وَصُمْتُ رَمَضانَ، وَأَحلَلتُ الحَلاَلَ، وَحَرَّمْتُ الحَرَامَ، وَلَمْ",
        "a": "عَلى ذَلِكَ شَيئاً أَأَدخُل الجَنَّة ؟ قَالَ: نَعَمْ)",
        },

    ],
    "choises":  [
      "أَزِدْ ",
      "أَرَأَيتَ ",
      "المَكْتُوبَاتِ",
      ],
     "answers":  [
      "أَرَأَيتَ ",
      "المَكْتُوبَاتِ",
      "أَزِدْ ",
          
      ],
      },
      {
    "section" : 3,
    "question": [
      {"b":"عَنْ أَبِي مَالِكٍ الحَارِثِ بنِ عَاصِم الأَشْعَرِيِّ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللهِ ﷺ :",
       "a":"",
       },
      {"b":"شَطْرُ الإِيْمَانِ، والحَمْدُ للهِ تَمْلأُ الميزانَ، وسُبْحَانَ اللهِ والحَمْدُ للهِ تَمْلآنِ - أَو تَمْلأُ - مَا بَيْنَ السّمَاواتِ والأَرْضِ، وَ",
       "a": "",
        },
      {"b":"نُورٌ، و",
        "a": "",
        },
      {"b": "بُرْهَانٌ، وَ",
        "a": "ضِيَاءٌ، وَالقُرْآنُ حُجَّةٌ لَكَ أَو عَلَيْكَ، كُلُّ النَّاسِ يَغْدُو فَبَائِعٌ نَفْسَهُ فَمُعْتِقُهَا أَو مُوبِقُهَا",
        }
    ],
    "choises":  [
      "الصَّلاةُ",
      "الصَّدَقَةُ",
      "الطُّهُورُ ",
      "الصَّبْرُ",    
      ],
     "answers":  [
      "الطُّهُورُ ",
      "الصَّلاةُ",
      "الصَّدَقَةُ",
      "الصَّبْرُ",
          
      ],
      },
      {
    "section" : 3,
    "question": [
      {"b":"عَنْ أَبِي مَالِكٍ الحَارِثِ بنِ عَاصِم الأَشْعَرِيِّ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللهِ ﷺ : (الطُّهُورُ",
       "a":"",
       },
      {"b":"الإِيْمَانِ، والحَمْدُ للهِ تَمْلأُ الميزانَ، وسُبْحَانَ اللهِ والحَمْدُ للهِ تَمْلآنِ - أَو تَمْلأُ - مَا بَيْنَ السّمَاواتِ والأَرْضِ، وَالصَّلاةُ",
       "a": "",
        },
      {"b":"والصَّدَقَةُ",
        "a": "",
        },
      {"b": "وَالصَّبْرُ",
        "a": "وَالقُرْآنُ حُجَّةٌ لَكَ أَو عَلَيْكَ، كُلُّ النَّاسِ يَغْدُو فَبَائِعٌ نَفْسَهُ فَمُعْتِقُهَا أَو مُوبِقُهَا)",
        }
    ],
    "choises":  [
      "شَطْرُ ",
      "بُرْهَانٌ",
      "نُورٌ",
      "ضِيَاءٌ",    
      ],
     "answers":  [
      "شَطْرُ ",
      "نُورٌ",
      "بُرْهَانٌ",
      "ضِيَاءٌ",
          
      ],
      },
      {
    "section" : 3,
    "question": [
      {"b":"عَنْ أَبي ذرٍّ الغِفَارْي رضي الله عنه عَن النبي ﷺ فيمَا يَرْويه عَنْ رَبِِّهِ عزَّ وجل أَنَّهُ قَالَ: ( يَا عِبَادِيْ لَوْ أنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإنْسَكُمْ وَجِنَّكُمْ قَامُوْا فِيْ",
       "a":"",
       },
      {"b":"وَاحِدٍ فَسَأَلُوْنِيْ فَأَعْطَيْتُ كُلَّ إِنسانٍ مَسْأَلَتَهُ مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِيْ إِلاَّ كَمَا يَنْقُصُ",
       "a": "",
        },
      {"b":"إَذَا أُدْخِلَ",
        "a": "",
        },

    ],
    "choises":  [
      "البَحْرَ",
      "المِخْيَطُ ",
      "صَعِيْدٍ ",    
      ],
     "answers":  [
      "صَعِيْدٍ ",
      "المِخْيَطُ ",
      "البَحْرَ",
          
      ],
      },
            {
    "section" : 3,
    "question": [
      {"b":"عَنْ أَبي ذرٍّ الغِفَارْي رضي الله عنه عَن النبي ﷺ فيمَا يَرْويه عَنْ رَبِِّهِ عزَّ وجل أَنَّهُ قَالَ: ( يَا عِبَادِيْ لَوْ أَنَّ",
       "a":"",
       },
      {"b":"وَ",
       "a": "",
        },
      {"b":"كَانُوْا عَلَى",
        "a": "",
        },
      {"b": "",
        "a": "رَجُلٍ وَاحِدٍ مِنْكُمْ مَا زَادَ ذَلِكَ فَيْ مُلْكِيْ شَيْئَاً.",
        }
    ],
    "choises":  [
      "قَلْبِ ",
      "أَوَّلَكُمْ وَآخِرَكُمْ",
      "أَتْقَى ",
      "إِنْسَكُمْ وَجِنَّكُمْ",    
      ],
     "answers":  [
      "أَوَّلَكُمْ وَآخِرَكُمْ",
      "إِنْسَكُمْ وَجِنَّكُمْ",
      "أَتْقَى ",
      "قَلْبِ ",
          
      ],
      },
            {
    "section" : 3,
    "question": [
      {"b":"عَنْ أَبي ذَرٍّ رضي الله عنه قال: أَنَّ أُنَاسَاً مِنْ أَصحَابِ رَسُولِ اللهِ ﷺ قَالوا للنَّبي ﷺ يَارَسُولَ الله: ذَهَبَ أَهلُ الدثورِ بِالأُجورِ، يُصَلُّوْنَ كَمَا نُصَلِّيْ، وَيَصُوْمُوْنَ كَمَا نَصُوْمُ، وَيَتَصَدَّقُوْنَ بفُضُوْلِ أَمْوَالِهِمْ، قَالَ: (أَوَ لَيْسَ قَدْ جَعَلَ اللهُ لَكُمْ مَا تَصَّدَّقُوْنَ؟ إِنَّ بِكُلِّ",
       "a":"",
       },
      {"b":"صَدَقَة.وَكُلِّ",
       "a": "",
        },
      {"b":"صَدَقَة.وَكُلِّ",
        "a": "",
        },
      {"b": "صَدَقَة.وَكُلِّ",
        "a": "وَأَمْرٌ بالِمَعْرُوْفٍ صَدَقَةٌ وَنَهْيٌ عَنْ مُنْكَرٍ صَدَقَةٌ وَفِيْ بُضْعِ أَحَدِكُمْ صَدَقَةٌ",
        }
    ],
    "choises":  [
      "تَسْبِيْحَةٍ ",
      "تَكْبِيْرَةٍ ",
      "تَهْلِيْلَةٍ ",
      "تَحْمَيْدَةٍ ",    
      ],
     "answers":  [
      "تَسْبِيْحَةٍ ",
      "تَكْبِيْرَةٍ ",
      "تَحْمَيْدَةٍ ",
      "تَهْلِيْلَةٍ ",
          
      ],
      },
            {
    "section" : 3,
    "question": [
      {"b":"عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ ﷺ : (كُلُّ",
       "a":"",
       },
      {"b":"مِنَ النَّاسِ عَلَيْهِ",
       "a": "",
        },
      {"b":"كُلَّ يَومٍ",
        "a": "",
        },
      {"b": "فِيْهِ الشَّمْسُ: يَعْدِلُ بَيْنَ الاثْنَيْنِ صَدَقَةٌ، وَيعِيْنُ الرَّجُلَ في",
        "a": "فَيحمله عَلَيْهَا أَو يَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ، وَالكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ، وَبِكُلِّ خُطْوَةٍ يمْشِيْهَا إِلَى الصَّلاةِ صَدَقَةٌ، وَيُمِيْطُ الأَذى عَنِ الطَّرِيْقِ صَدَقَةٌ)",
        }
    ],
    "choises":  [
      "دَابَّتِهِ ",
      "سُلامَى ",
      "صَدَقَةٌ ",
      "تَطْلُعُ ",    
      ],
     "answers":  [
      "سُلامَى ",
      "صَدَقَةٌ ",
      "تَطْلُعُ ",
      "دَابَّتِهِ ",
          
      ],
      },
            {
    "section" : 3,
    "question": [
      {"b":"عن النواس بن سمعان رضي الله عنهما ، عن النبي ﷺ قال: (البر حسن",
       "a":"",
       },
      {"b":"والإثم",
       "a": "",
        },
      {"b":"في نفسك و",
        "a": "أن يطلع عليه الناس ) ",
        },

    ],
    "choises":  [
      "كرهت",
      "ما حاك",
      "الخلق ",    
      ],
     "answers":  [
      "الخلق ",
      "ما حاك",
      "كرهت",
          
      ],
      },
            {
    "section" : 3,
    "question": [
      {"b":"عن وابصة بن معبد رضى الله عنه ، قال : أتيت رسول الله ﷺ ، فقال : (جئت تسأل عن البر ؟) قلت : نعم ؛ قال : (استفت قلبك ؛ البر ما اطمأنت إليه النفس واطمأن اليه القلب ، والإثم ما حاك في",
       "a":"",
       },
      {"b":"وتردد في",
       "a": "",
        },
      {"b":"وإن ",
        "a": "",
        },
      {"b": "الناس و",
        "a": "",
        }
    ],
    "choises":  [
      "أفتاك ",
      "أفتوك",
      "الصدر ",
      "النفس ",    
      ],
     "answers":  [
      "النفس ",
      "الصدر ",
      "أفتاك ",
      "أفتوك",
          
      ],
      },
                 {
    "section" : 3,
    "question": [
      {"b":"عَن أَبي نَجِيحٍ العربَاضِ بنِ سَاريَةَ رضي الله عنه قَالَ: وَعَظَنا رَسُولُ اللهِ مَوعِظَةً وَجِلَت مِنهَا",
        "a": "",
        },
      {"b":"وَذَرَفَت مِنهَا",
        "a": "",
        },
      {"b":"فَقُلْنَا: يَارَسُولَ اللهِ كَأَنَّهَا مَوْعِظَةُ مُوَدِّعٍ فَأَوصِنَا، قَالَ: (أُوْصِيْكُمْ بِتَقْوَى اللهِ عز وجل وَالسَّمعِ وَالطَّاعَةِ وَإِنْ تَأَمَّرَ عَلَيْكُمْ",
        "a": "",
        },
      {"b":"فَإِنَّهُ مَنْ",
        "a": "مِنْكُمْ فَسَيَرَى اخْتِلافَاً كَثِيرَاً؛ فَعَلَيكُمْ بِسُنَّتِيْ وَسُنَّةِ الخُلَفَاءِ الرَّاشِدِينَ المّهْدِيِّينَ عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ وَإِيَّاكُمْ وَمُحْدَثَاتِ الأُمُورِ فإنَّ كلّ مُحدثةٍ بدعة، وكُلَّ بِدْعَةٍ ضَلالَةٌ) ",
        },
    ],
    "choises":  [
      "القُلُوبُ ",
      "العُيون",
      "يَعِشْ ",
      "عَبْدٌ",  
      ],
     "answers":  [
      "القُلُوبُ ",
      "العُيون",
      "عَبْدٌ",
      "يَعِشْ ",
          
      ],
      },

          {
    "section" : 3,
    "question": [
      {"b":"عَنْ أَبِيْ ثَعْلَبَةَ الخُشَنِيِّ جُرثُومِ بنِ نَاشِرٍ رضي الله عنه عَن رَسُولِ اللهِ ﷺ قَالَ: (إِنَّ اللهَ فَرَضَ فَرَائِضَ فَلا",
        "a": "",
        },
      {"b":"وَحَدَّ حُدُودَاً فَلا",
        "a": "",
        },
      {"b":"وَحَرَّمَ أَشْيَاءَ فَلا",
        "a": "",
        },
      {"b":"وَسَكَتَ عَنْ أَشْيَاءَ رَحْمَةً لَكُمْ غَيْرَ نِسْيَانٍ فَلا",
        "a": "",
        },
    ],
    "choises":  [
      "تَبْحَثُوا عَنْهَا",
      "تَنْتَهِكُوهَا",
      "تَعْتَدُوهَا ",
      "تُضَيِّعُوهَا",  
      ],
     "answers":  [
      "تُضَيِّعُوهَا",
      "تَعْتَدُوهَا ",
      "تَنْتَهِكُوهَا",
      "تَبْحَثُوا عَنْهَا",
          
      ],
      },
          {
    "section" : 4,
    "question": [
      {"b":"عَنْ أَبي العَباس سَعدِ بنِ سَهلٍ السَّاعِدي رضي الله عنه قَالَ: جَاءَ رَجُلٌ إِلَى النبي ﷺ فَقَالَ: يَا رَسُول الله: دُلَّني عَلَى عَمَلٍ إِذَا عَمِلتُهُ أَحَبَّني اللهُ، وَأَحبَّني النَاسُ ؟ فَقَالَ: (ازهَد في",
        "a": "",
        },
      {"b":"يُحِبُّكَ ",
        "a": "",
        },
      {"b":"وازهَد فيمَا عِندَ",
        "a": "",
        },
      {"b":"يُحِبُّكَ ",
        "a": "",
        },
    ],
    "choises":  [
      "اللهُ ",
      "النَّاسِ ",
      "الدُّنيَا ",
      "النَّاسُ",  
      ],
     "answers":  [
      "الدُّنيَا ",
      "اللهُ ",
      "النَّاسِ ",
      "النَّاسُ",
          
      ],
      },
          {
    "section" : 4,
    "question": [
      {"b":"عنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا أَنَّ رَسُولَ اللهِ ﷺ قَالَ:",
        "a": "",
        },
      {"b":"النَّاسُ بِدعوَاهُمْ",
        "a": "",
        },
      {"b":"رِجَالٌ أَمْوَال قَومٍ وَدِمَاءهُمْ، وَلَكِنِ",
        "a": "",
        },
      {"b":"عَلَى المُدَّعِي، وَ",
        "a": "عَلَى مَن أَنكَر",
        },
    ],
    "choises":  [
      "لادَّعَى ",
      "لَوْ يُعْطَى",
      "البَينَةُ ",
      "اليَمينُ",  
      ],
     "answers":  [
      "لَوْ يُعْطَى",
      "لادَّعَى ",
      "البَينَةُ ",
      "اليَمينُ",
          
      ],
      },
          {
    "section" : 4,
    "question": [
      {"b":"عَنْ أَبي سَعيدٍ الخُدريِّ رضي الله عنه قَالَ: سَمِعتُ رِسُولَ اللهِ ﷺ يَقولُ: (مَن رَأى مِنكُم مُنكَرَاً فَليُغَيِّرْهُ",
        "a": "",
        },
      {"b":"فَإِنْ لَمْ يَستَطعْ",
        "a": "",
        },
      {"b":"فَإِنْ لَمْ يَستَطعْ",
        "a": "وَذَلِكَ أَضْعَفُ الإيمَانِ)",
        },

    ],
    "choises":  [
      "بِيَدِهِ",
      "فَبِلِسَانِهِ",
      "فَبِقَلبِه ",
      ],
     "answers":  [
      "بِيَدِهِ",
      "فَبِلِسَانِهِ",
      "فَبِقَلبِه ",
         
      ],
      },
          {
    "section" : 4,
    "question": [
      {"b":"عَنْ أَبي هُرَيرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ ﷺ : (لاَ ",
        "a": "",
        },
      {"b":"وَلاَ",
        "a": "",
        },
      {"b":"وَلاَ",
        "a": "",
        },
      {"b":"وَلاَ",
        "a": "وَلاَ يَبِع بَعضُكُم عَلَى بَيعِ بَعضٍ، وَكونوا عِبَادَ اللهِ إِخوَانَاً، المُسلِمُ أَخو المُسلم، لاَ يَظلِمهُ، وَلاَ يَخذُلُهُ، وَلا يكْذِبُهُ، وَلايَحْقِرُهُ، التَّقوَى هَاهُنَا - وَيُشيرُ إِلَى صَدرِهِ ثَلاَثَ مَراتٍ - بِحَسْبِ امرىء مِن الشَّرأَن يَحْقِرَ أَخَاهُ المُسلِمَ، كُلُّ المُسِلمِ عَلَى المُسلِمِ حَرَام دَمُهُ وَمَالُه وَعِرضُه) ",
        },
    ],
    "choises":  [
      "تَبَاغَضوا",
      "تَنَاجَشوا",
      "تَحَاسَدوا",
      "تَدَابَروا",  
      ],
     "answers":  [
      "تَحَاسَدوا",
      "تَنَاجَشوا",
      "تَبَاغَضوا",
      "تَدَابَروا",
          
      ],
      },    {
    "section" : 4,
    "question": [
      {"b":"عَنْ أَبي هُرَيرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ ﷺ : (لاَ تَحَاسَدوا، وَلاَتَنَاجَشوا، وَلاَ تَبَاغَضوا، وَلاَ تَدَابَروا، وَلاَ يَبِع بَعضُكُم عَلَى بَيعِ بَعضٍ، وَكونوا عِبَادَ اللهِ إِخوَانَاً، المُسلِمُ أَخو المُسلم، لاَ",
        "a": "",
        },
      {"b":"وَلاَ",
        "a": "",
        },
      {"b":"وَلاَ",
        "a": "",
        },
      {"b":"وَلاَ",
        "a": "التَّقوَى هَاهُنَا - وَيُشيرُ إِلَى صَدرِهِ ثَلاَثَ مَراتٍ - بِحَسْبِ امرىء مِن الشَّرأَن يَحْقِرَ أَخَاهُ المُسلِمَ، كُلُّ المُسِلمِ عَلَى المُسلِمِ حَرَام دَمُهُ وَمَالُه وَعِرضُه) ",
        },
    ],
    "choises":  [
      "يَظلِمهُ",
      "يكْذِبُهُ",
      "يَخذُلُهُ",
      "يَحْقِرُهُ",  
      ],
     "answers":  [
      "يَظلِمهُ",
      "يَخذُلُهُ",
      "يكْذِبُهُ",
      "يَحْقِرُهُ",
          
      ],
      },  
          {
    "section" : 4,
    "question": [
      {"b":"عَنْ أَبي هُرَيرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ ﷺ : (لاَ تَحَاسَدوا، وَلاَتَنَاجَشوا، وَلاَ تَبَاغَضوا، وَلاَ تَدَابَروا، وَلاَ يَبِع بَعضُكُم عَلَى بَيعِ بَعضٍ، وَكونوا عِبَادَ اللهِ إِخوَانَاً، المُسلِمُ أَخو المُسلم، لاَ يَظلِمهُ، وَلاَ يَخذُلُهُ، وَلا يكْذِبُهُ، وَلايَحْقِرُهُ، التَّقوَى هَاهُنَا - وَيُشيرُ إِلَى صَدرِهِ ثَلاَثَ مَراتٍ - بِحَسْبِ امرىء مِن الشَّرأَن يَحْقِرَ",
        "a": "",
        },
      {"b":"المُسلِمَ، كُلُّ المُسِلمِ عَلَى المُسلِمِ حَرَام",
        "a": "",
        },
      {"b":"وَ",
        "a": "",
        },
      {"b":"وَ",
        "a": "",
        },
    ],
    "choises":  [
      "مَالُه",
      "دَمُهُ ",
      "عِرضُه",
      "أَخَاهُ ",  
      ],
     "answers":  [
      "أَخَاهُ ",
      "دَمُهُ ",
      "مَالُه",
      "عِرضُه",
          
      ],
      },  
          {
    "section" : 4,
    "question": [
      {"b":"عَنْ أَبي هُرَيرَة رضي الله عنه عَنِ النبي ﷺ قَالَ:  مَا اجتَمَعَ قَومٌ في بَيتٍ مِنْ بيوتِ اللهِ يَتلونَ كِتابِ اللهِ وَيتَدارَسونهَ بَينَهُم إِلا نَزَلَت عَلَيهُم ",
        "a": "",
        },
      {"b":"وَغَشيَتهم",
        "a": "",
        },
      {"b":"وحَفَتهُمُ ",
        "a": "وَذَكَرهُم اللهُ فيمَن عِندَهُ"
        },

    ],
    "choises":  [
      "الرَّحمَة ",
      "السَّكينَة ", 
      "المَلائِكة ",   
      ],
     "answers":  [
      "السَّكينَة ",
      "الرَّحمَة ",
      "المَلائِكة ", 

          
      ],
      },  
          {
    "section" : 4,
    "question": [
      {"b":"عَن ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا عَنِ النبي ﷺ فِيْمَا يَرْوِيْهِ عَنْ رَبِّهِ تَبَارَكَ وَتَعَالى أَنَّهُ قَالَ: (إِنَّ الله كَتَبَ الحَسَنَاتِ وَالسَّيئَاتِ ثُمَّ بَيَّنَ ذَلِكَ؛ فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللهُ عِنْدَهُ",
        "a": "",
        },
      {"b":"وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللهُ عِنْدَهُ ",
        "a": "",
        },
      {"b":" إِلَى",
        "a": "",
        },
      {"b":" إِلىَ أَضْعَاف كَثِيْرَةٍ. وَإِنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللهُ عِنْدَهُ حَسَنَةً كَامِلَةً،وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللهُ",
        "a": "",
        },
    ],
    "choises":  [
      "حَسَنَةً كَامِلَةً",
      "سَبْعِمائَةِ ضِعْفٍ",
      "سَيِّئَةً وَاحِدَةً",
      "عَشْرَ حَسَنَاتٍ",  
      ],
     "answers":  [
      "حَسَنَةً كَامِلَةً",
      "عَشْرَ حَسَنَاتٍ",
      "سَبْعِمائَةِ ضِعْفٍ",
      "سَيِّئَةً وَاحِدَةً",
          
      ],
      },  
          {
    "section" : 4,
    "question": [
      {"b":"عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ ﷺ : (إِنَّ اللهَ تَعَالَى قَالَ: مَنْ عَادَى لِي",
        "a": "",
        },
      {"b":"فَقَدْ آذَنْتُهُ بِالحَرْبِ. وَمَا تَقَرَّبَ إِلِيَّ عَبْدِيْ بِشَيءٍ أَحَبَّ إِلِيَّ مِمَّا افْتَرَضْتُ",
        "a": "",
        },
      {"b":"وما يَزَالُ عَبْدِيْ يَتَقَرَّبُ إِلَيَّ",
        "a": "",
        },
      {"b":"حَتَّى",
        "a": "فَإِذَا أَحْبَبتُهُ كُنْتُ سَمْعَهُ الَّذِيْ يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِيْ يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي يَمْشِيْ بِهَا. وَلَئِنْ سَأَلَنِيْ لأُعطِيَنَّهُ، وَلَئِنْ اسْتَعَاذَنِيْ لأُعِيْذَنَّهُ)",
        },
    ],
    "choises":  [
      "أُحِبَّهُ",
      "عَلَيْهِ",
      "بِالنَّوَافِلِ ",
      "وَلِيَّاً ",  
      ],
     "answers":  [
      "وَلِيَّاً ",
      "عَلَيْهِ",
      "بِالنَّوَافِلِ ",
      "أُحِبَّهُ",
          
      ],
      },  
          {
    "section" : 4,
    "question": [
      {"b":"عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا أَنَّ رَسُولَ اللهِ ﷺ قَال: (إِنَّ اللهَ",
        "a": "",
        },
      {"b":"لِي عَنْ أُمَّتِي",
        "a": "",
        },
      {"b":"وَ",
        "a": "",
        },
      {"b":"وَ",
        "a": "",
        },
    ],
    "choises":  [
      "النِّسْيَانَ",
      "تَجَاوَزَ ",
      "الخَطَأَ",
      "مَا اسْتُكْرِهُوا عَلَيْهِ",  
      ],
     "answers":  [
      "تَجَاوَزَ ",
      "الخَطَأَ",
      "النِّسْيَانَ",
      "مَا اسْتُكْرِهُوا عَلَيْهِ",
          
      ],
      },  
          {
    "section" : 4,
    "question": [
      {"b":"عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا قَالَ: أَخَذَ رَسُولُ اللهِ ﷺ",
        "a": "",
        },
      {"b":"فَقَالَ: (كُنْ فِي الدُّنْيَا كَأَنَّكَ",
        "a": "",
        },
      {"b":"أَوْ عَابِرُ",
        "a": "وَكَانَ ابْنُ عُمَرَ رَضِيَ اللهُ عَنْهُمَا يَقُوْلُ: إِذَا أَمْسَيْتَ فَلا تَنْتَظِرِ الصَّبَاحَ، وَإِذَا أَصْبَحْتَ فَلا تَنْتَظِرِ المَسَاءَ. وَخُذْ مِنْ صِحَّتِكَ لِمَرَضِكَ، وَمِنْ حَيَاتِكَ لمَوْتِكَ..",
        },

    ],
    "choises":  [
      "بِمنْكبيَّ ",
      "غَرِيْبٌ ",
      "سَبِيْلٍ",
      ],
     "answers":  [
      "بِمنْكبيَّ ",
      "غَرِيْبٌ ",
      "سَبِيْلٍ",         
      ],
      },  
          {
    "section" : 4,
    "question": [
      {"b":"عَنْ أَبِيْ مُحَمَّدٍ عَبْدِ اللهِ بِنِ عمْرِو بْنِ العَاصِ رَضِيَ اللهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللهِ صلى الله عليه وسلم: (لا",
        "a": "",
        },
      {"b":"أَحَدُكُمْ حَتَّى يَكُونَ هَواهُ",
        "a": "",
        },
      {"b":"لِمَا",
        "a": "بِهِ)",
        },
  
    ],
    "choises":  [
      "تَبَعَاً ",
      "جِئْتُ ",
      "يُؤْمِنُ",  
      ],
     "answers":  [
      "يُؤْمِنُ",
      "تَبَعَاً ",
      "جِئْتُ ",
          
      ],
      },  
          {
    "section" : 4,
    "question": [
      {"b":"عَنْ أَنَسِ بْنِ مَالِكٍ رضي الله عنه قَالَ: سَمِعْتُ رَسُولَ اللهِ يَقُولُ: قَالَ اللهُ تَعَالَى: (يَا ابْنَ آَدَمَ إِنَّكَ مَا",
        "a": "",
        },
      {"b":"وَ",
        "a": "",
        },
      {"b":"غَفَرْتُ",
        "a": "",
        },
      {"b":"عَلَى مَا كَانَ ",
        "a": "وَلا أُبَالِيْ، يَا ابْنَ آَدَمَ لَو بَلَغَتْ ذُنُوبُكَ عَنَانَ السَّمَاءِ ثُمَّ استَغْفَرْتَنِيْ غَفَرْتُ لَكَ، يَا ابْنَ آَدَمَ إِنَّكَ لَو أَتَيْتَنِيْ بِقُرَابِ الأَرْضِ خَطَايَا ثُمَّ لقِيْتَنِيْ لاَ تُشْرِك بِيْ شَيْئَاً لأَتَيْتُكَ بِقُرَابِهَا مَغفِرَةً)",
        },
    ],
    "choises":  [
      "دَعَوتَنِيْ",
      "رَجَوتَنِيْ",
      "مِنْكَ",
      "لَكَ",  
      ],
     "answers":  [
      "دَعَوتَنِيْ",
      "رَجَوتَنِيْ",
      "لَكَ",
      "مِنْكَ",
          
      ],
      },  
          {
    "section" : 4,
    "question": [
      {"b":"عَنْ أَنَسِ بْنِ مَالِكٍ رضي الله عنه قَالَ: سَمِعْتُ رَسُولَ اللهِ يَقُولُ: قَالَ اللهُ تَعَالَى: (يَا ابْنَ آَدَمَ إِنَّكَ مَا دَعَوتَنِيْ وَرَجَوتَنِيْ غَفَرْتُ لَكَ عَلَى مَا كَانَ مِنْكَ وَلا",
        "a": "",
        },
      {"b":"يَا ابْنَ آَدَمَ لَو بَلَغَتْ ذُنُوبُكَ",
        "a": "",
        },
      {"b":"السَّمَاءِ ثُمَّ استَغْفَرْتَنِيْ غَفَرْتُ لَكَ، يَا ابْنَ آَدَمَ إِنَّكَ لَو أَتَيْتَنِيْ بِقُرَابِ الأَرْضِ",
        "a": "",
        },
      {"b":"ثُمَّ لقِيْتَنِيْ لاَ تُشْرِك بِيْ شَيْئَاً لأَتَيْتُكَ بِقُرَابِهَا",
        "a": "",
        },
    ],
    "choises":  [
      "عَنَانَ ",
      "خَطَايَا ",
      "أُبَالِيْ",
      "مَغفِرَةً",  
      ],
     "answers":  [
      "أُبَالِيْ",
      "عَنَانَ ",
      "خَطَايَا ",
      "مَغفِرَةً",
          
      ],
      },  
          {
    "section" : 4,
    "question": [
      {"b":"عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا قَالَ: أَخَذَ رَسُولُ اللهِ ﷺ بِمنْكبيَّ فَقَالَ: (كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِيْبٌ أَوْ عَابِرُ سَبِيْلٍ) وَكَانَ ابْنُ عُمَرَ رَضِيَ اللهُ عَنْهُمَا يَقُوْلُ: إِذَا أَمْسَيْتَ فَلا تَنْتَظِرِ الصَّبَاحَ، وَإِذَا أَصْبَحْتَ فَلا تَنْتَظِرِ المَسَاءَ. وَخُذْ مِنْ",
        "a": "",
        },
      {"b":"لِ",
        "a": "",
        },
      {"b":"وَمِنْ",
        "a": "",
        },
      {"b":"لِ",
        "a": "",
        },
    ],
    "choises":  [
      "صِحَّتِكَ ",
      "مَرَضِكَ",
      "مَوْتِكَ",
      "حَيَاتِكَ",  
      ],
     "answers":  [
      "صِحَّتِكَ ",
      "مَرَضِكَ",
      "حَيَاتِكَ",
      "مَوْتِكَ",
          
      ],
      },  
        
      
 ];