  List<Map> matchingquestionss1 = [
    {"index" : 0 , "data" :"أطوار خلق الانسان وخاتمته "},
    {"index" : 0 , "data" :"أبو عبد الرحمن عبد الله بن مسعود"},
    {"index" : 1 , "data" :"الحلال والحرام "},
    {"index" : 1 , "data" :"أبو عبد الله النعمان بن بشير"},
    {"index" : 2 , "data" :"حرمة المسلم "},
    {"index" : 2 , "data" :"ابن عمر"},
    {"index" : 3 , "data" :"مراتب الدين "},
    {"index" : 3 , "data" :"عمر بن الخطاب "},
    {"index" : 4 , "data" :"الحلال الطيب شرط القبول "},
    {"index" : 4 , "data" :"أبو هريرة"},
  ];

    List<Map> matchingquestionss2 = [
    {"index" : 0 , "data" :"الأخذ باليقين والبعد عن الشبهات "},
    {"index" : 0 , "data" :"أبو محمد الحسن بن علي بن أبي طالب "},
    {"index" : 1 , "data" :"حرمة دم المسلم "},
    {"index" : 1 , "data" :"ابن مسعود"},
    {"index" : 2 , "data" :"عموم الإحسان "},
    {"index" : 2 , "data" :"أبو يعلي شداد بن أوس"},
    {"index" : 3 , "data" :"تقوى الله تعالى وحسن الخلق "},
    {"index" : 3 , "data" :"وبي ذر جندب بن جنادة وأبو عبد الرحمن معاذ بن جبل "},
    {"index" : 4 , "data" :"عون الله تعالى وحفظه  "},
    {"index" : 4 , "data" :"أبو العباس عبد الله بن عباس"},
  ];

    List<Map> matchingquestionss3 = [
    {"index" : 0 , "data" :"الاستقامة  والايمان "},
    {"index" : 0 , "data" :"أبي عمرو وقيل أبو عمرة سفيان بن عبد الله الثقفي"},
    {"index" : 1 , "data" :"طريق الجنة "},
    {"index" : 1 , "data" :"أبو عبد الله جابر بن عبد الله الأنصاري"},
    {"index" : 2 , "data" :"من جوامع الخير "},
    {"index" : 2 , "data" :"أبو مالك الحارث بن عاصم الأشعري"},
    {"index" : 3 , "data" :"البر والإثم "},
    {"index" : 3 , "data" :"النواس بن سمعان "},
    {"index" : 4 , "data" :"وجوب لزوم السنة واجتناب البدع "},
    {"index" : 4 , "data" :"أبو نجيح العرباض بن سارية"},
  ];

    List<Map> matchingquestionss4 = [
    {"index" : 0 , "data" :"حدود الله تعالى وحرماته "},
    {"index" : 0 , "data" :"أبو ثعلبة الخشني جرثوم بن ناشر"},
    {"index" : 1 , "data" :"حقيقة الزهد وثمراته "},
    {"index" : 1 , "data" :"أبو العباس سهل بن سعد الساعدي"},
    {"index" : 2 , "data" :"اتباع شرع الله تعالى عماد الدين "},
    {"index" : 2 , "data" :"أبو محمد عبد الله بن عمرو بن العاصي "},
    {"index" : 3 , "data" :"عدل الله تعالى وفضله ورحمته "},
    {"index" : 3 , "data" :"ابن عباس"},
    {"index" : 4 , "data" :"اغتنام الدنيا للفوز بالاخرة "},
    {"index" : 4 , "data" :"ابن عمر "},
  ];