List orderingquestions = [
  {
    "section" : 1,
    "title" : "عَنْ أَمِيرِ المُؤمِنينَ أَبي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ قَالَ : سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ: إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ،",
    "truelist" :
     ["وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى" ,
      "فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله" ,
      "فَهِجْرتُهُ إلى اللهِ وَرَسُوُله" ,
      "وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا" ,
      "أَو امْرأَةٍ يَنْكِحُهَا" ,
      "فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ" ,
      ],
    "falselist" :
    [ "فَهِجْرتُهُ إلى اللهِ وَرَسُوُله" ,
      "وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا" ,
      "وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى" ,
      "فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ" ,
      "فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله" ,
      "أَو امْرأَةٍ يَنْكِحُهَا" ,
      ],
  },
    {
    "section" : 1,
    "title" : "عَنْ عُمَرَ رَضِيَ اللهُ تَعَالَى عَنْهُ قَال: بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللهِ ",
    "truelist" :
     [
      "ذَاتَ يَوْمٍ" ,
      "إَذْ طَلَعَ عَلَيْناَ رَجُلٌ" ,
      "شَدِيْدُ بَيَاضِ الثّياب" ,
      "شَدِيْدُ سَوَادِ الشَّعْرِ" ,
      "لاَ يُرَى عَلَيهِ أَثَرُ السَّفَرِ" ,
      "وَلاَ يَعْرِفُهُ مِنا أحَدٌ"
      ],
    "falselist" :
    ["ذَاتَ يَوْمٍ" ,
      "لاَ يُرَى عَلَيهِ أَثَرُ السَّفَرِ" ,
      "شَدِيْدُ بَيَاضِ الثّياب" ,
      "شَدِيْدُ سَوَادِ الشَّعْرِ" ,
      "إَذْ طَلَعَ عَلَيْناَ رَجُلٌ" ,
      "وَلاَ يَعْرِفُهُ مِنا أحَدٌ" ,
      ],
  },
    {
    "section" : 1,
    "title" : "قَالَ: فَأَخْبِرِنيْ عَنِ الإِيْمَانِ، قَالَ:",
    "truelist" :
     ["أَنْ تُؤمِنَ بِالله" ,
      "وَمَلاِئكَتِه" ,
      "وَكُتُبِهِ " ,
      "وَرُسُلِهِ " ,
      "وَالْيَومِ الآَخِر" ,
      "وَتُؤْمِنَ بِالقَدَرِ " ,
      "خَيْرِهِ وَشَرِّهِ" ,
      ],
    "falselist" :
    ["وَكُتُبِهِ " ,
      "وَتُؤْمِنَ بِالقَدَرِ " ,
      "أَنْ تُؤمِنَ بِالله" ,
      "وَرُسُلِهِ " ,
      "وَمَلاِئكَتِه" ,
      "وَالْيَومِ الآَخِر" ,
      "خَيْرِهِ وَشَرِّهِ" ,
      ],
  },
    {
    "section" : 1,
    "title" : "قَالَ: فَأَخْبِرْنِي عَنِ السَّاعَةِ",
    "truelist" :
     [
      "قال: مَا الْمَسئُوُلُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ" ,
      "قَالَ : فَأخْبِرْنِيْ عَنْ أَمَارَتِها" ,
      "قال: أَنْ تَلِدَ الأَمَةُ رَبَّتَهَا " ,
      "وَأَنْ تَرى الحُفَاةَ العُرَاةَ العَالَةَ" ,
      "رِعَاءَ الشَّاءِ" ,
      "يَتَطَاوَلُوْنَ فِي البُنْيَانِ" ,
      ],
    "falselist" :
    ["رِعَاءَ الشَّاءِ" ,
      "وَأَنْ تَرى الحُفَاةَ العُرَاةَ العَالَةَ" ,
      "قَالَ : فَأخْبِرْنِيْ عَنْ أَمَارَتِها" ,
      "قال: أَنْ تَلِدَ الأَمَةُ رَبَّتَهَا " ,
      "قال: مَا الْمَسئُوُلُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ" ,
      "يَتَطَاوَلُوْنَ فِي البُنْيَانِ" ,
      ],
  },
    {
    "section" : 1,
    "title" : "عَنْ أَبِيْ عَبْدِ الرَّحْمَنِ عَبْدِ اللهِ بْنِ عُمَرَ بْن الخَطَّابِ رَضِيَ اللهُ عَنْهُمَا قَالَ: سَمِعْتُ رسول الله ﷺ يَقُوْلُ:",
    "truelist" :
     ["بُنِيَ الإِسْلامُ عَلَى خَمْسٍ:" ,
      "شَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ الله وَأَنَّ مُحَمَّدَاً رَسُوْلُ اللهِ" ,
      "وَإِقَامِ الصَّلاةِ" ,
      "وَإِيْتَاءِ الزَّكَاةِ" ,
      "وَحَجِّ البِيْتِ" ,
      " وَصَوْمِ رَمَضَانَ" ,
      ],
    "falselist" :
    ["بُنِيَ الإِسْلامُ عَلَى خَمْسٍ:" ,
      "وَإِقَامِ الصَّلاةِ" ,
      "وَإِيْتَاءِ الزَّكَاةِ" ,
      "شَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ الله وَأَنَّ مُحَمَّدَاً رَسُوْلُ اللهِ" ,
      "وَحَجِّ البِيْتِ" ,
      " وَصَوْمِ رَمَضَانَ" ,
   
      ],
  },
    {
    "section" : 1,
    "title" : "عَنْ أبي عبد الرحمن عَبْدِ اللهِ بنِ مَسْعُوْدْ رَضِيَ اللهُ عَنْهُ قَالَ: حَدَّثَنَا رَسُوْلُ اللهِ ﷺ وَهُوَ الصَّادِقُ المَصْدُوْقُ: إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِيْ بَطْنِ أُمِّهِ أَرْبَعِيْنَ يَوْمَاً   ",
    "truelist" :
     [
      "ثُمَّ يَكُوْنُ عَلَقَةً مِثْلَ ذَلِكَ" ,
      "ثُمَّ يَكُوْنُ مُضْغَةً مِثْلَ ذَلِكَ" ,
      "ثُمَّ يُرْسَلُ إِلَيْهِ المَلَكُ" ,
      "فَيَنفُخُ فِيْهِ الرٌّوْحَ" ,
      "وَيَؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ" ,
      "بِكَتْبِ رِزْقِهِ وَأَجَلِهِ وَعَمَلِهِ وَشَقِيٌّ أَوْ سَعِيْدٌ" ,
      ],
    "falselist" :
    ["ثُمَّ يَكُوْنُ مُضْغَةً مِثْلَ ذَلِكَ" ,
      "فَيَنفُخُ فِيْهِ الرٌّوْحَ" ,
      "وَيَؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ" ,
      "بِكَتْبِ رِزْقِهِ وَأَجَلِهِ وَعَمَلِهِ وَشَقِيٌّ أَوْ سَعِيْدٌ" ,
      "ثُمَّ يَكُوْنُ عَلَقَةً مِثْلَ ذَلِكَ" ,
      "ثُمَّ يُرْسَلُ إِلَيْهِ المَلَكُ" ,
      ],
  },
    {
    "section" : 1,
    "title" : "عَنْ أُمِّ المُؤمِنِينَ أُمِّ عَبْدِ اللهِ عَائِشَةَ - رَضِيَ اللهُ عَنْهَا - قَالَتْ: قَالَ رَسُوْلُ اللهِ: مَنْ أَحْدَثَ فِيْ أَمْرِنَا ",
    "truelist" :
     [
      "هَذَا " ,
      "مَا لَيْسَ" ,
      "مِنْهُ " ,
      "فَهُوَ " ,
      "رَدّ" ,
      ],
    "falselist" :
    [
      "هَذَا " ,
      "مِنْهُ " ,
      "رَدّ" ,
      "مَا لَيْسَ" ,
      "فَهُوَ " ,
      ],
  },
    {
    "section" : 1,
    "title" : "عَنْ أَبِيْ عَبْدِ اللهِ النُّعْمَانِ بْنِ بِشِيْر رضي الله عنهما قَالَ: سَمِعْتُ رَسُوْلَ اللهِ ﷺ يَقُوْلُ: إِنَّ الحَلالَ بَيِّنٌ وَإِنَّ الحَرَامَ بَيِّنٌ",
    "truelist" :
     [
      "وَبَيْنَهُمَا  مُشْتَبِهَات" ,
      "لا يَعْلَمُهُنَّ كَثِيْرٌ مِنَ النَّاس" ,
      "فَمَنِ اتَّقَى الشُّبُهَاتِ" ,
      "فَقَدِ اسْتَبْرأَ لِدِيْنِهِ وعِرْضِه" ,
      "وَمَنْ وَقَعَ فِي الشُّبُهَاتِ" ,
      "وَقَعَ فِي الحَرَامِ كَالرَّاعِي يَرْعَى حَوْلَ الحِمَى يُوشِكُ أَنْ يَرْتَعَ فِيْهِ" ,
      ],
    "falselist" :
    [
      "وَبَيْنَهُمَا  مُشْتَبِهَات" ,
      "فَقَدِ اسْتَبْرأَ لِدِيْنِهِ وعِرْضِه" ,
      "وَقَعَ فِي الحَرَامِ كَالرَّاعِي يَرْعَى حَوْلَ الحِمَى يُوشِكُ أَنْ يَرْتَعَ فِيْهِ" ,
      "فَمَنِ اتَّقَى الشُّبُهَاتِ" ,
      "لا يَعْلَمُهُنَّ كَثِيْرٌ مِنَ النَّاس" ,
      "وَمَنْ وَقَعَ فِي الشُّبُهَاتِ" ,
      ],
  },
    {
    "section" : 1,
    "title" : "عَنْ أَبِيْ عَبْدِ اللهِ النُّعْمَانِ بْنِ بِشِيْر رضي الله عنهما قَالَ: سَمِعْتُ رَسُوْلَ اللهِ ﷺ يَقُوْلُ: أَلا وَإِنَّ لِكُلِّ مَلِكٍ حِمَىً",
    "truelist" :
     [
      "أَلا وَإِنَّ حِمَى اللهِ مَحَارِمُهُ" ,
      "أَلا وإِنَّ فِي الجَسَدِ مُضْغَةً" ,
      "إِذَا صَلَحَتْ صَلَحَ الجَسَدُ كُلُّهُ" ,
      "وإذَا فَسَدَت فَسَدَ الجَسَدُ كُلُّهُ" ,
      "أَلا وَهيَ القَلْبُ" ,
      ],
    "falselist" :
    ["أَلا وإِنَّ فِي الجَسَدِ مُضْغَةً" ,
      "وإذَا فَسَدَت فَسَدَ الجَسَدُ كُلُّهُ" ,
      "إِذَا صَلَحَتْ صَلَحَ الجَسَدُ كُلُّهُ" ,
      "أَلا وَهيَ القَلْبُ" ,
      "أَلا وَإِنَّ حِمَى اللهِ مَحَارِمُهُ" ,
      ],
  },
    {
    "section" : 1,
    "title" : "عَنْ أَبِيْ رُقَيَّةَ تَمِيْم بْنِ أَوْسٍ الدَّارِيِّ رضي الله عنه أَنَّ النبي ﷺ قَالَ: الدِّيْنُ النَّصِيْحَةُ",
    "truelist" :
     [
      "قُلْنَا: لِمَنْ ؟" ,
      "قَالَ: للهِ" ,
      "ولكتابه" ,
      "ولِرَسُوْلِهِ" ,
      "وَلأَئِمَّةِ المُسْلِمِيْنَ" ,
      "وَعَامَّتِهِمْ" ,
      ],
    "falselist" :
    [
      "قُلْنَا: لِمَنْ ؟" ,
      "ولِرَسُوْلِهِ" ,
      "ولكتابه" ,
      "وَلأَئِمَّةِ المُسْلِمِيْنَ" ,
      "قَالَ: للهِ" ,
      "وَعَامَّتِهِمْ" ,
      ],
  },
    {
    "section" : 1,
    "title" : "عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا أَنَّ رَسُوْلَ اللهِ قَالَ:أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى",
    "truelist" :
     ["يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللهُ وَأَنَّ مُحَمَّدَاً رَسُوْلُ اللهِ" ,
      "وَيُقِيْمُوْا الصَّلاةَ وَيُؤْتُوا الزَّكَاةَ" ,
      "فَإِذَا فَعَلُوا ذَلِكَ" ,
      "عَصَمُوا مِنِّي دِمَاءهَمْ وَأَمْوَالَهُمْ" ,
      "إِلاَّ بِحَقِّ الإِسْلامِ" ,
      "وَحِسَابُهُمْ" ,
      "عَلَى اللهِ تَعَالَى" ,
      ],
    "falselist" :
    ["فَإِذَا فَعَلُوا ذَلِكَ" ,
      "وَيُقِيْمُوْا الصَّلاةَ وَيُؤْتُوا الزَّكَاةَ" ,
      "إِلاَّ بِحَقِّ الإِسْلامِ" ,
      "يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللهُ وَأَنَّ مُحَمَّدَاً رَسُوْلُ اللهِ" ,
      "عَلَى اللهِ تَعَالَى" ,
      "عَصَمُوا مِنِّي دِمَاءهَمْ وَأَمْوَالَهُمْ" ,
      "وَحِسَابُهُمْ" ,
      ],
  },
    {
    "section" : 1,
    "title" : "عَنْ أَبِي هُرَيْرَةَ عَبْدِ الرَّحْمَنِ بْنِ صَخْرٍ رَضِيَ الله تَعَالَى عَنْهُ قَالَ: سَمِعْتُ رَسُوْلَ اللهِ ﷺ يَقُوْلُ : مَا نَهَيْتُكُمْ عَنْهُ",
    "truelist" :
     [
      "فَاجْتَنِبُوهُ " ,
      "وَمَا أَمَرْتُكُمْ بِهِ" ,
      "فأْتُوا مِنْهُ" ,
      "مَا اسْتَطَعْتُمْ" ,
      "فَإِنَّمَا أَهْلَكَ الَّذِيْنَ مِنْ قَبْلِكُمْ كَثْرَةُ مَسَائِلِهِمْ" ,
      "وَاخْتِلافُهُمْ عَلَى أَنْبِيَائِهِمْ" ,
      ],
    "falselist" :
    ["فَاجْتَنِبُوهُ " ,
      "فأْتُوا مِنْهُ" ,
      "فَإِنَّمَا أَهْلَكَ الَّذِيْنَ مِنْ قَبْلِكُمْ كَثْرَةُ مَسَائِلِهِمْ" ,
      "مَا اسْتَطَعْتُمْ" ,
      "وَمَا أَمَرْتُكُمْ بِهِ" ,
      "وَاخْتِلافُهُمْ عَلَى أَنْبِيَائِهِمْ" ,
      ],
  },
    {
    "section" : 1,
    "title" : "عَنْ أَبِيْ هُرَيْرَةَ رَضِيَ اللهُ تَعَالَى عَنْهُ قَالَ: قَالَ رَسُوْلُ اللهِ صلى الله عليه وسلم: إِنَّ اللهَ تَعَالَى ",
    "truelist" :
     [
      "طَيِّبٌ لاَ يَقْبَلُ إِلاَّ طَيِّبَاً" ,
      "وَإِنَّ اللهَ" ,
      "أَمَرَ المُؤْمِنِيْنَ بِمَا أَمَرَ بِهِ المُرْسَلِيْنَ" ,
      "فَقَالَ تعالى: (يَا أَيُّهَا الرُّسُلُ كُلُوا مِنَ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحاً) " ,
      "وَقَالَ تعالى: (يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ )" ,
      ],
    "falselist" :
    ["طَيِّبٌ لاَ يَقْبَلُ إِلاَّ طَيِّبَاً" ,
      "وَقَالَ تعالى: (يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ )" ,
      "فَقَالَ تعالى: (يَا أَيُّهَا الرُّسُلُ كُلُوا مِنَ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحاً) " ,
      "أَمَرَ المُؤْمِنِيْنَ بِمَا أَمَرَ بِهِ المُرْسَلِيْنَ" ,
      "وَإِنَّ اللهَ" ,
      ],
  },
    {
    "section" : 1,
    "title" : " ثُمَّ ذَكَرَ الرَّجُلَ يُطِيْلُ السَّفَرَ " ,
    "truelist" :
     [
      "أَشْعَثَ أَغْبَرَ" ,
      "يَمُدُّ يَدَيْهِ إِلَى السَّمَاء،ِ يَا رَبُّ يَا رَبُّ" ,
      " وَمَطْعَمُهُ حَرَامٌ" ,
      "وَمَشْرَبُهُ حَرَامٌ" ,
      "وَمَلبَسُهُ حَرَامٌ" ,
      "وَغُذِيَ بِالحَرَامِ فَأَنَّى يُسْتَجَابُ لذلك" ,
      ],
    "falselist" :
    [
      "يَمُدُّ يَدَيْهِ إِلَى السَّمَاء،ِ يَا رَبُّ يَا رَبُّ" ,
      " وَمَطْعَمُهُ حَرَامٌ" ,
      "وَمَلبَسُهُ حَرَامٌ" ,
      "وَغُذِيَ بِالحَرَامِ فَأَنَّى يُسْتَجَابُ لذلك" ,
      "وَمَشْرَبُهُ حَرَامٌ" ,
      "أَشْعَثَ أَغْبَرَ" ,
      ],
  },
  {
    "section" : 2,
    "title" : "عنِ ابْنِ مَسْعُودٍ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ : (لا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ يشهَدُ أَنْ لا إلهَ إلّا اللهُ وأنّي رسولُ اللهِ إِلاَّ بإِحْدَى ثَلاثٍ:",
    "truelist" :
     [
      "الثَّيِّبُ",
      "الزَّانِيْ",
      "وَالنَّفْسُ بِالنَّفْسِ",
      "وَالتَّاركُ ",
      "لِدِيْنِهِ ",
      "المُفَارِقُ ",
      "للجمَاعَةِ"
      ],
    "falselist" :
    [
      "لِدِيْنِهِ ",
      "الزَّانِيْ",
      "وَالنَّفْسُ بِالنَّفْسِ",
      "للجمَاعَةِ",
      "الثَّيِّبُ",
      "وَالتَّاركُ ",
      "المُفَارِقُ ",
      ],
  },
  {
    "section" : 2,
    "title" : "عَن أَبِي هُرَيْرَةَ رضي الله عنه أَنَّ رَسُولَ اللهِ ﷺ قَالَ:",
    "truelist" :
     [
      "مَنْ كَانَ يُؤمِنُ بِاللهِ وَاليَوْمِ الآخِرِ فَلْيَقُلْ خَيْرَاً أَو لِيَصْمُتْ،",
      "وَمَنْ كَانَ يُؤمِنُ بِاللهِ وَاليَومِ الآخِرِ فَلْيُكْرِمْ جَارَهُ",
      "ومَنْ كَانَ يُؤمِنُ بِاللهِ واليَومِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ",
      
      ],
    "falselist" :
    [
      "وَمَنْ كَانَ يُؤمِنُ بِاللهِ وَاليَومِ الآخِرِ فَلْيُكْرِمْ جَارَهُ",
      "ومَنْ كَانَ يُؤمِنُ بِاللهِ واليَومِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ",
      "مَنْ كَانَ يُؤمِنُ بِاللهِ وَاليَوْمِ الآخِرِ فَلْيَقُلْ خَيْرَاً أَو لِيَصْمُتْ،",
     
      ],
  },
  {
    "section" : 2,
    "title" : "عَنْ أَبِي يَعْلَى شَدَّادِ بنِ أَوْسٍ رَضِيَ اللهُ تَعَالَى عَنْهُ عَنْ رَسُولِ اللهِ ﷺ قَالَ: إِنَّ اللهَ كَتَبَ الإِحْسانَ ",
    "truelist" :
     [
      " عَلَى كُلِّ شَيءٍ",
      "فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا القِتْلَةَ",
      "وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ",
      "وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ",
      "وَلْيُرِحْ ذَبِيْحَتَهُ",
      ],
    "falselist" :
    [
      "وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ",
      " عَلَى كُلِّ شَيءٍ",
      "وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ",
      "فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا القِتْلَةَ",
      "وَلْيُرِحْ ذَبِيْحَتَهُ",
      ],
  },
  {
    "section" : 2,
    "title" : "عَنْ أَبِيْ ذَرٍّ جُنْدُبِ بنِ جُنَادَةَ وَأَبِي عَبْدِ الرَّحْمَنِ مُعَاذِ بِنِ جَبَلٍ رَضِيَ اللهُ عَنْهُمَا عَنْ رَسُولِ اللهِ ﷺ قَالَ: اتَّقِ اللهَ حَيْثُمَا كُنْتَ",
    "truelist" :
     [
      "وَأَتْبِعِ ",
      "السَّيِّئَةَ ",
      "الحَسَنَةَ ",
      "تَمْحُهَا",
      "وَخَالِقِ النَّاسَ بِخُلُقٍ",
      "حَسَنٍ ",
      ],
    "falselist" :
    [
      "وَأَتْبِعِ ",
      "وَخَالِقِ النَّاسَ بِخُلُقٍ",
      "الحَسَنَةَ ",
      "حَسَنٍ ",
      "السَّيِّئَةَ ",
      "تَمْحُهَا",
      ],
  },
  {
    "section" : 2,
    "title" : "عَنْ أَبِي العَبَّاسٍ عَبْدِ اللهِ بنِ عَبَّاسٍ رضي الله عنهما قَالَ: كُنْتُ خَلْفَ النبي ﷺ يَومَاً فَقَالَ: ",
    "truelist" :
     [
      "يَا غُلاَمُ إِنّي أُعَلِّمُكَ كَلِمَاتٍ :",
      "احْفَظِ اللهَ يَحفَظك",
      "احْفَظِ اللهَ",
      "تَجِدهُ تُجَاهَكَ",
      "إِذَاَ سَأَلْتَ فَاسْأَلِ اللهَ",
      "وَإِذَاَ اسْتَعَنتَ فَاسْتَعِن بِاللهِ",

      ],
    "falselist" :
    [
      "احْفَظِ اللهَ يَحفَظك",
      "احْفَظِ اللهَ",
      "يَا غُلاَمُ إِنّي أُعَلِّمُكَ كَلِمَاتٍ :",
      "تَجِدهُ تُجَاهَكَ",
      "إِذَاَ سَأَلْتَ فَاسْأَلِ اللهَ",
      "وَإِذَاَ اسْتَعَنتَ فَاسْتَعِن بِاللهِ",
      ],
  },
  {
    "section" : 2,
    "title" : "وَاعْلَم أَنَّ الأُمّة لو اجْتَمَعَت عَلَى أن يَنفَعُوكَ بِشيءٍ",
    "truelist" :
     [
      "لَمْ يَنْفَعُوكَ إِلا بِشيءٍ",
      "قَد كَتَبَهُ اللهُ لَك",
      "وإِن اِجْتَمَعوا عَلَى أَنْ يَضُرُّوكَ بِشيءٍ",
      "لمْ يَضروك إلا بشيءٍ",
      "قَد كَتَبَهُ اللهُ عَلَيْكَ",
      "رُفعَت الأَقْلامُ، وَجَفّتِ الصُّحُفُ",
      ],
    "falselist" :
    [
      "قَد كَتَبَهُ اللهُ لَك",
      "لمْ يَضروك إلا بشيءٍ",
      "قَد كَتَبَهُ اللهُ عَلَيْكَ",
      "وإِن اِجْتَمَعوا عَلَى أَنْ يَضُرُّوكَ بِشيءٍ",
      "لَمْ يَنْفَعُوكَ إِلا بِشيءٍ",
      "رُفعَت الأَقْلامُ، وَجَفّتِ الصُّحُفُ",
      ],
  },
  {
    "section" : 2,
    "title" : "في الرواية الثانية لحديث عون الله تعالى وحفظه: اِحفظِ اللهَ",
    "truelist" :
     [
      "تَجٍدْهُ أَمَامَكَ",
      "تَعَرَّفْ إلى اللهِ في الرَّخاءِ يَعرِفْكَ في الشّدةِ",
      "وَاعْلَم أن مَا أَخطأكَ لَمْ يَكُن لِيُصيبكَ، وَمَا أَصَابَكَ لَمْ يَكُن لِيُخطِئكَ",
      "وَاعْلَمْ أنَّ النَّصْرَ مَعَ الصَّبْرِ",
      "وَأَنَّ الفَرَجَ مَعَ الكَربِ",
      "وَأَنَّ مَعَ العُسرِ يُسراً",
      ],
    "falselist" :
    [
      "تَعَرَّفْ إلى اللهِ في الرَّخاءِ يَعرِفْكَ في الشّدةِ",
      "وَاعْلَم أن مَا أَخطأكَ لَمْ يَكُن لِيُصيبكَ، وَمَا أَصَابَكَ لَمْ يَكُن لِيُخطِئكَ",
      "وَأَنَّ مَعَ العُسرِ يُسراً",
      "وَاعْلَمْ أنَّ النَّصْرَ مَعَ الصَّبْرِ",
      "وَأَنَّ الفَرَجَ مَعَ الكَربِ",
      "تَجٍدْهُ أَمَامَكَ",
      ],
  },
  {
    "section" : 2,
    "title" : "عَنْ أَبيْ مَسْعُوْدٍ عُقبَة بنِ عَمْرٍو الأَنْصَارِيِّ البَدْرِيِّ رضي الله عنه قَالَ: قَالَ رَسُوْلُ اللهِ ﷺ: إِنَّ مِمَّا أَدرَكَ النَاسُ",
    "truelist" :
     [
      "مِن كَلاَمِ",
      "النُّبُوَّةِ الأُولَى",
      "إذا لم تستحِ",
      "فاصْنَعْ ",
      "مَا شِئتَ",
      ],
    "falselist" :
    [
      "مِن كَلاَمِ",
      "إذا لم تستحِ",
      "مَا شِئتَ",
      "النُّبُوَّةِ الأُولَى",
      "فاصْنَعْ ",
      ],
  },
  {
    "section" : 2,
    "title" : "عَنْ أَبِي مُحَمَّدٍ الحَسَنِ بنِ عَلِيّ بنِ أبِي طالبٍ سِبْطِ رَسُولِ اللهِ ﷺ وَرَيْحَانَتِهِ رَضِيَ اللهُ عَنْهُمَا قَالَ: حَفِظْتَ مِنْ رَسُوْلِ اللهِ ﷺ :",
    "truelist" :
     [
      "دَعْ مَا",
      "يَرِيْبُكَ ",
      "إِلَى مَا",
      "لاَ يَرِيْبُكَ",

      ],
    "falselist" :
    [
      "لاَ يَرِيْبُكَ",
      "دَعْ مَا",
      "إِلَى مَا",
      "يَرِيْبُكَ ",

      ],
  },
  {
    "section" : 2,
    "title" : "عَنْ أَبِيْ هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُوْلُ اللهِ ﷺ :",
    "truelist" :
     [
      "مِنْ حُسْنِ",
      "إِسْلامِ ",
      "المَرْءِ ",
      "تَرْكُهُ مَا",
      "لاَ يَعْنِيْهِ",

      ],
    "falselist" :
    [
      "إِسْلامِ ",
      "لاَ يَعْنِيْهِ",
      "تَرْكُهُ مَا",
      "مِنْ حُسْنِ",
      "المَرْءِ ",

      ],
  },
  {
    "section" : 3,
    "title" : "عَنِ أَبيْ عَمْرٍو، وَقِيْلَ،أَبيْ عمْرَةَ سُفْيَانَ بنِ عَبْدِ اللهِ الثَّقَفيِّ رضي الله عنه قَالَ: قُلْتُ يَا رَسُوْلَ اللهِ",
    "truelist" :
     [
      "قُلْ لِيْ",
      "فِي الإِسْلامِ",
      "قَوْلاً لاَ",
      "أَسْأَلُ عَنْهُ أَحَدَاً",
      "غَيْرَكَ؟",
      "قَالَ: (قُلْ آمَنْتُ باللهِ ثُمَّ استَقِمْ)",
      ],
    "falselist" :
    [
      "قَوْلاً لاَ",
      "غَيْرَكَ؟",
      "قُلْ لِيْ",
      "فِي الإِسْلامِ",
      "قَالَ: (قُلْ آمَنْتُ باللهِ ثُمَّ استَقِمْ)",
      "أَسْأَلُ عَنْهُ أَحَدَاً",
      ],
  },
  {
    "section" : 3,
    "title" : "عَنْ أَبيْ عَبْدِ اللهِ جَابِرِ بنِ عَبْدِ اللهِ الأَنْصَارِيِّ رضي الله عنه أَنَّ رَجُلاً سَأَلَ رسولَ اللهِ ﷺ فَقَالَ: أَرَأَيتَ إِذا صَلَّيْتُ",
    "truelist" :
     [
      "المَكْتُوبَاتِ",
      "وَصُمْتُ رَمَضانَ",
      "وَأَحلَلتُ الحَلاَلَ",
      "وَحَرَّمْتُ الحَرَامَ",
      "وَلَمْ أَزِدْ عَلى ذَلِكَ",
      "شَيئاً أَأَدخُل الجَنَّة ؟ قَالَ: نَعَمْ",
      ],
    "falselist" :
    [
      "المَكْتُوبَاتِ",
      "وَحَرَّمْتُ الحَرَامَ",
      "وَصُمْتُ رَمَضانَ",
      "شَيئاً أَأَدخُل الجَنَّة ؟ قَالَ: نَعَمْ",
      "وَلَمْ أَزِدْ عَلى ذَلِكَ",
      "وَأَحلَلتُ الحَلاَلَ",
      ],
  },
  {
    "section" : 3,
    "title" : "عَنْ أَبِي مَالِكٍ الحَارِثِ بنِ عَاصِم الأَشْعَرِيِّ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللهِ ﷺ  : الطُّهُورُ شَطْرُ الإِيْمَانِ، ",
    "truelist" :
     [
      "والحَمْدُ للهِ",
      "تَمْلأُ الميزانَ، وسُبْحَانَ اللهِ والحَمْدُ للهِ",
      "تَمْلآنِ - أَو تَمْلأُ - مَا بَيْنَ السّمَاواتِ والأَرْضِ،",
      "وَالصَّلاةُ نُورٌ",
      "والصَّدَقَةُ بُرْهَانٌ",
      "وَالصَّبْرُ ضِيَاءٌ",
      "وَالقُرْآنُ حُجَّةٌ لَكَ أَو عَلَيْكَ",
      ],
    "falselist" :
    [
      "تَمْلآنِ - أَو تَمْلأُ - مَا بَيْنَ السّمَاواتِ والأَرْضِ،",
      "وَالصَّلاةُ نُورٌ",
      "والحَمْدُ للهِ",
      "وَالصَّبْرُ ضِيَاءٌ",
      "والصَّدَقَةُ بُرْهَانٌ",
      "تَمْلأُ الميزانَ، وسُبْحَانَ اللهِ والحَمْدُ للهِ",
      "وَالقُرْآنُ حُجَّةٌ لَكَ أَو عَلَيْكَ",
      ],
  },
  {
    "section" : 3,
    "title" : "عَنْ أَبي ذرٍّ الغِفَارْي رضي الله عنه عَن النبي ﷺ فيمَا يَرْويه عَنْ رَبِِّهِ عزَّ وجل أَنَّهُ قَالَ: يَا عِبَادِيْ إِنِّيْ حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِيْ وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمَاً",
    "truelist" :
     [
      "فَلا تَظَالَمُوْا",
      "يَا عِبَادِيْ كُلُّكُمْ ضَالٌّ إِلاَّ مَنْ هَدَيْتُهُ فَاسْتَهْدُوْنِي أَهْدِكُمْ",
      "يَا عِبَادِيْ كُلُّكُمْ جَائِعٌ إِلاَّ مَنْ أَطْعَمْتُهُ فاَسْتَطْعِمُونِي أُطْعِمْكُمْ",
      "يَا عِبَادِيْ كُلُّكُمْ عَارٍ إِلاَّ مَنْ كَسَوْتُهُ فَاسْتَكْسُوْنِيْ أَكْسُكُمْ",
      "يَا عِبَادِيْ إِنَّكُمْ تُخْطِئُوْنَ بِاللَّيْلِ وَالنَّهَارِ",
      "وَأَنَا أَغْفِرُ الذُّنُوْبَ جَمِيْعَاً",
      "فَاسْتَغْفِرُوْنِيْ أَغْفِرْ لَكُمْ",
      ],
    "falselist" :
    [
      "يَا عِبَادِيْ إِنَّكُمْ تُخْطِئُوْنَ بِاللَّيْلِ وَالنَّهَارِ",
      "يَا عِبَادِيْ كُلُّكُمْ ضَالٌّ إِلاَّ مَنْ هَدَيْتُهُ فَاسْتَهْدُوْنِي أَهْدِكُمْ",
      "يَا عِبَادِيْ كُلُّكُمْ جَائِعٌ إِلاَّ مَنْ أَطْعَمْتُهُ فاَسْتَطْعِمُونِي أُطْعِمْكُمْ",
      "وَأَنَا أَغْفِرُ الذُّنُوْبَ جَمِيْعَاً",
      "فَلا تَظَالَمُوْا",
      "فَاسْتَغْفِرُوْنِيْ أَغْفِرْ لَكُمْ",
      "يَا عِبَادِيْ كُلُّكُمْ عَارٍ إِلاَّ مَنْ كَسَوْتُهُ فَاسْتَكْسُوْنِيْ أَكْسُكُمْ",
      ],
  },
  {
    "section" : 3,
    "title" : "عَنْ أَبي ذرٍّ الغِفَارْي رضي الله عنه عَن النبي ﷺ فيمَا يَرْويه عَنْ رَبِِّهِ عزَّ وجل أَنَّهُ قَالَ: يَا عِبَادِيْ إِنَّكُمْ لَنْ تَبْلُغُوْا ضَرِّيْ",
    "truelist" :
     [
      " فَتَضُرُّوْنِيْ",
      "وَلَنْ تَبْلُغُوْا نَفْعِيْ فَتَنْفَعُوْنِيْ",
      "يَا عِبَادِيْ لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوْا عَلَى أَتْقَى",
      "قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ مَا زَادَ ذَلِكَ فَيْ مُلْكِيْ شَيْئَاً.",
      "يَا عِبَادِيْ لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوْا عَلَى أَفْجَرِ",
      "قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ مَا نَقَصَ ذَلِكَ مِنْ مُلْكِيْ شَيْئَاً",

      ],
    "falselist" :
    [
      "قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ مَا نَقَصَ ذَلِكَ مِنْ مُلْكِيْ شَيْئَاً",
      "قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ مَا زَادَ ذَلِكَ فَيْ مُلْكِيْ شَيْئَاً.",
      " فَتَضُرُّوْنِيْ",
      "يَا عِبَادِيْ لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوْا عَلَى أَتْقَى",
      "يَا عِبَادِيْ لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوْا عَلَى أَفْجَرِ",
      "وَلَنْ تَبْلُغُوْا نَفْعِيْ فَتَنْفَعُوْنِيْ",
      ],
  },
   {
    "section" : 3,
    "title" : "عَنْ أَبي ذرٍّ الغِفَارْي رضي الله عنه عَن النبي ﷺ فيمَا يَرْويه عَنْ رَبِِّهِ عزَّ وجل أَنَّهُ قَالَ: يَا عِبَادِيْ لَوْ أنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإنْسَكُمْ وَجِنَّكُمْ قَامُوْا",
    "truelist" :
     [
      "فِيْ صَعِيْدٍ وَاحِدٍ",
      "فَسَأَلُوْنِيْ فَأَعْطَيْتُ كُلَّ إِنسانٍ مَسْأَلَتَهُ",
      "مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِيْ إِلاَّ كَمَا يَنْقُصُ",
      "المِخْيَطُ إَذَا أُدْخِلَ البَحْرَ",
      "يَا عِبَادِيْ إِنَّمَا هِيَ أَعْمَالُكُمْ أُحْصِيْهَا لَكُمْ ثُمَّ أُوَفِّيْكُمْ إِيَّاهَا",
      "فَمَنْ وَجَدَ خَيْرَاً فَليَحْمَدِ اللهَ وَمَنْ وَجَدَ غَيْرَ ذَلِكَ فَلاَ يَلُوْمَنَّ إِلاَّ نَفْسَهُ",
      ],
    "falselist" :
    [
      "فَسَأَلُوْنِيْ فَأَعْطَيْتُ كُلَّ إِنسانٍ مَسْأَلَتَهُ",
      "مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِيْ إِلاَّ كَمَا يَنْقُصُ",
      "المِخْيَطُ إَذَا أُدْخِلَ البَحْرَ",
      "يَا عِبَادِيْ إِنَّمَا هِيَ أَعْمَالُكُمْ أُحْصِيْهَا لَكُمْ ثُمَّ أُوَفِّيْكُمْ إِيَّاهَا",
      "فِيْ صَعِيْدٍ وَاحِدٍ",
      "فَمَنْ وَجَدَ خَيْرَاً فَليَحْمَدِ اللهَ وَمَنْ وَجَدَ غَيْرَ ذَلِكَ فَلاَ يَلُوْمَنَّ إِلاَّ نَفْسَهُ",
      ],
  },
   {
    "section" : 3,
    "title" : "عَنْ أَبي ذَرٍّ رضي الله عنه قال: أَنَّ أُنَاسَاً مِنْ أَصحَابِ رَسُولِ اللهِ ﷺ قَالوا للنَّبي ﷺ يَارَسُولَ الله ذَهَبَ أَهلُ الدثورِ بِالأُجورِ:",
    "truelist" :
     [
      "يُصَلُّوْنَ كَمَا نُصَلِّيْ",
      "وَيَصُوْمُوْنَ كَمَا نَصُوْمُ",
      "وَيَتَصَدَّقُوْنَ بفُضُوْلِ أَمْوَالِهِمْ",
      "قَالَ: (أَوَ لَيْسَ قَدْ جَعَلَ اللهُ لَكُمْ مَا تَصَّدَّقُوْنَ؟",
      "إِنَّ بِكُلِّ تَسْبِيْحَةٍ صَدَقَة.وَكُلِّ تَكْبِيْرَةٍ صَدَقَةً وَكُلِّ تَحْمَيْدَةٍ صَدَقَةً",
      "وَكُلِّ تَهْلِيْلَةٍ صَدَقَةٌ وَأَمْرٌ بالِمَعْرُوْفٍ صَدَقَةٌ وَنَهْيٌ عَنْ مُنْكَرٍ صَدَقَةٌ وَفِيْ بُضْعِ أَحَدِكُمْ صَدَقَةٌ",
      ],
    "falselist" :
    [
      "قَالَ: (أَوَ لَيْسَ قَدْ جَعَلَ اللهُ لَكُمْ مَا تَصَّدَّقُوْنَ؟",
      "يُصَلُّوْنَ كَمَا نُصَلِّيْ",
      "وَكُلِّ تَهْلِيْلَةٍ صَدَقَةٌ وَأَمْرٌ بالِمَعْرُوْفٍ صَدَقَةٌ وَنَهْيٌ عَنْ مُنْكَرٍ صَدَقَةٌ وَفِيْ بُضْعِ أَحَدِكُمْ صَدَقَةٌ",
      "وَيَصُوْمُوْنَ كَمَا نَصُوْمُ",
      "إِنَّ بِكُلِّ تَسْبِيْحَةٍ صَدَقَة.وَكُلِّ تَكْبِيْرَةٍ صَدَقَةً وَكُلِّ تَحْمَيْدَةٍ صَدَقَةً",
      "وَيَتَصَدَّقُوْنَ بفُضُوْلِ أَمْوَالِهِمْ",
      ],
  },
   {
    "section" : 3,
    "title" : "عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ ﷺ  كُلُّ سُلامَى مِنَ النَّاسِ عَلَيْهِ: ",
    "truelist" :
     [
      "صَدَقَةٌ كُلَّ يَومٍ تَطْلُعُ فِيْهِ الشَّمْسُ:",
      "يَعْدِلُ بَيْنَ الاثْنَيْنِ صَدَقَةٌ",
      "وَيُعِيْنُ الرَّجُلَ في دَابَّتِهِ فيَحمِلهُ عَلَيْهَا أَو يَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ",
      "وَالكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ",
      "وَبِكُلِّ خُطْوَةٍ يَمْشِيْهَا إِلَى الصَّلاةِ صَدَقَةٌ",
      "وَيُمِيْطُ الأَذى عَنِ الطَّرِيْقِ صَدَقَةٌ",
      ],
    "falselist" :
    [
      "صَدَقَةٌ كُلَّ يَومٍ تَطْلُعُ فِيْهِ الشَّمْسُ:",
      "وَالكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ",
      "وَبِكُلِّ خُطْوَةٍ يَمْشِيْهَا إِلَى الصَّلاةِ صَدَقَةٌ",
      "وَيُمِيْطُ الأَذى عَنِ الطَّرِيْقِ صَدَقَةٌ",
      "وَيُعِيْنُ الرَّجُلَ في دَابَّتِهِ فيَحمِلهُ عَلَيْهَا أَو يَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ",
      "يَعْدِلُ بَيْنَ الاثْنَيْنِ صَدَقَةٌ",
      ],
  },
   {
    "section" : 3,
    "title" : "عَن أَبي نَجِيحٍ العربَاضِ بنِ سَاريَةَ رضي الله عنه قَالَ: وَعَظَنا رَسُولُ اللهِ مَوعِظَةً وَجِلَت مِنهَا القُلُوبُ وَذَرَفَت مِنهَا العُيون. فَقُلْنَا: يَارَسُولَ اللهِ كَأَنَّهَا مَوْعِظَةُ مُوَدِّعٍ فَأَوصِنَا، قَالَ:",
    "truelist" :
     [
      "أُوْصِيْكُمْ بِتَقْوَى اللهِ عز وجل وَالسَّمعِ وَالطَّاعَةِ",
      "وَإِنْ تَأَمَّرَ عَلَيْكُمْ عَبْدٌ",
      "وإِنَّهُ مَنْ يَعِشْ مِنْكُمْ",
      "فسَيَرَى اخْتِلافَاً كَثِيرَاً",
      "فَعَلَيكُمْ بِسُنَّتِيْ وَسُنَّةِ الخُلَفَاءِ الرَّاشِدِينَ المّهْدِيِّينَ",
      "عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ وَإِيَّاكُمْ",
      "وَمُحْدَثَاتِ الأُمُورِ فإنَّ كلّ  بِدْعَةٍ ضَلالَةٌ",
      ],
    "falselist" :
    [
      "وإِنَّهُ مَنْ يَعِشْ مِنْكُمْ",
      "فسَيَرَى اخْتِلافَاً كَثِيرَاً",
      "أُوْصِيْكُمْ بِتَقْوَى اللهِ عز وجل وَالسَّمعِ وَالطَّاعَةِ",
      "وَمُحْدَثَاتِ الأُمُورِ فإنَّ كلّ  بِدْعَةٍ ضَلالَةٌ",
      "وَإِنْ تَأَمَّرَ عَلَيْكُمْ عَبْدٌ",
      "عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ وَإِيَّاكُمْ",
      "فَعَلَيكُمْ بِسُنَّتِيْ وَسُنَّةِ الخُلَفَاءِ الرَّاشِدِينَ المّهْدِيِّينَ",
      ],
  },
   {
    "section" : 3,
    "title" : "قالَ: أَلا أُخْبِرُكَ بِرَأْسِ الأَمْرِ وَعَمُودِهِ وَذِرْوَةِ سَنَامِهِ ؟",
    "truelist" :
     [
      " قُلْتُ: بَلَى يَارَسُولَ اللهِ",
      "قَالَ: رَأْسُ الأَمْرِ الإِسْلامُ وَعَمُودُهُ الصَّلاةُ وَذروَةُ سَنَامِهِ الجِهَادُ",
      "ثُمَّ قَالَ: أَلا أُخبِرُكَ بِملاكِ ذَلِكَ كُلِّهِ ؟ قُلْتُ:بَلَى يَارَسُولَ اللهِ",
      "فَأَخَذَ بِلِسَانِهِ وَقَالَ: كُفَّ عَلَيْكَ هَذَا",
      "قُلْتُ يَانَبِيَّ اللهِ وَإِنَّا لَمُؤَاخَذُونَ بِمَا نَتَكَلَّمُ بِهِ ؟",
      "فَقَالَ: ثَكِلَتْكَ أُمُّكَ يَامُعَاذُ. وَهَلْ يَكُبُّ النَّاسَ فِي النَّارِ عَلَى وُجُوهِهِمْ ",
      "أَو قَالَ: عَلَى مَنَاخِرِهِمْ إِلاَّ حَصَائِدُ أَلسِنَتِهِمْ",
      ],
    "falselist" :
    [
      "فَأَخَذَ بِلِسَانِهِ وَقَالَ: كُفَّ عَلَيْكَ هَذَا",
      "قَالَ: رَأْسُ الأَمْرِ الإِسْلامُ وَعَمُودُهُ الصَّلاةُ وَذروَةُ سَنَامِهِ الجِهَادُ",
      "فَقَالَ: ثَكِلَتْكَ أُمُّكَ يَامُعَاذُ. وَهَلْ يَكُبُّ النَّاسَ فِي النَّارِ عَلَى وُجُوهِهِمْ ",
      " قُلْتُ: بَلَى يَارَسُولَ اللهِ",
      "أَو قَالَ: عَلَى مَنَاخِرِهِمْ إِلاَّ حَصَائِدُ أَلسِنَتِهِمْ",
      "قُلْتُ يَانَبِيَّ اللهِ وَإِنَّا لَمُؤَاخَذُونَ بِمَا نَتَكَلَّمُ بِهِ ؟",
      "ثُمَّ قَالَ: أَلا أُخبِرُكَ بِملاكِ ذَلِكَ كُلِّهِ ؟ قُلْتُ:بَلَى يَارَسُولَ اللهِ",
      ],
  },
   {
    "section" : 3,
    "title" : "عَنْ أَبِيْ ثَعْلَبَةَ الخُشَنِيِّ جُرثُومِ بنِ نَاشِرٍ رضي الله عنه عَن رَسُولِ اللهِ ﷺ قَالَ: إِنَّ اللهَ فَرَضَ فَرَائِضَ",
    "truelist" :
     [
      "فَلا تُضَيِّعُوهَا",
      "وَحَدَّ حُدُودَاً",
      "فَلا تَعْتَدُوهَا",
      "وَحَرَّمَ أَشْيَاءَ",
      "فَلا تَنْتَهِكُوهَا",
      "وَسَكَتَ عَنْ أَشْيَاءَ رَحْمَةً لَكُمْ غَيْرَ نِسْيَانٍ فَلا تَبْحَثُوا عَنْهَا",
      ],
    "falselist" :
    [
      "وَحَدَّ حُدُودَاً",
      "وَحَرَّمَ أَشْيَاءَ",
      "فَلا تَنْتَهِكُوهَا",
      "فَلا تَعْتَدُوهَا",
      "وَسَكَتَ عَنْ أَشْيَاءَ رَحْمَةً لَكُمْ غَيْرَ نِسْيَانٍ فَلا تَبْحَثُوا عَنْهَا",
      "فَلا تُضَيِّعُوهَا",
      ],
  },
   {
    "section" : 4,
    "title" : "عَنْ أَبي العَباس سَهلِ بنِ سَعدٍ السَّاعِدي رضي الله عنه قَالَ: جَاءَ رَجُلٌ إِلَى النبي ﷺ فَقَالَ: يَا رَسُول الله : دُلَّني عَلَى عَمَلٍ",
    "truelist" :
     [
      "إِذَا عَمِلتُهُ",
      "أَحَبَّني اللهُ، وَأَحبَّني النَاسُ",
      "فَقَالَ: (ازهَد في الدُّنيَا",
      "يُحِبُّكَ اللهُ",
      "وازهَد فيمَا عِندَ النَّاسِ",
      "يُحِبُّكَ النَّاسُ",
      ],
    "falselist" :
    [
      "أَحَبَّني اللهُ، وَأَحبَّني النَاسُ",
      "وازهَد فيمَا عِندَ النَّاسِ",
      "فَقَالَ: (ازهَد في الدُّنيَا",
      "يُحِبُّكَ النَّاسُ",
      "إِذَا عَمِلتُهُ",
      "يُحِبُّكَ اللهُ",
      ],
  },
   {
    "section" : 4,
    "title" : "عنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا أَنَّ رَسُولَ اللهِ ﷺ قَالَ: لَوْ يُعْطَى النَّاسُ بِدعوَاهُمْ",
    "truelist" :
     [
      "لادَّعَى رِجَالٌ",
      " أَمْوَال قَومٍ وَدِمَاءهُمْ",
      "لَكِنِ البَينَةُ",
      "عَلَى المُدَّعِي",
      "وَاليَمينُ",
      "عَلَى مَن أَنكَر",
      ],
    "falselist" :
    [
      "لادَّعَى رِجَالٌ",
      "لَكِنِ البَينَةُ",
      "وَاليَمينُ",
      " أَمْوَال قَومٍ وَدِمَاءهُمْ",
      "عَلَى المُدَّعِي",
      "عَلَى مَن أَنكَر",
      ],
  },
   {
    "section" : 4,
    "title" : "عَنْ أَبي سَعيدٍ الخُدريِّ رضي الله عنه قَالَ: سَمِعتُ رِسُولَ اللهِ ﷺ يَقولُ:",
    "truelist" :
     [
      "مَن رَأى مِنكُم مُنكَرَاً",
      "فَليُغَيِّرْهُ بِيَدِهِ",
      "فَإِنْ لَمْ يَستَطعْ فَبِلِسَانِهِ",
      "فَإِنْ لَمْ يَستَطعْ فَبِقَلبِه",
      "وَذَلِكَ أَضْعَفُ الإيمَانِ",

      ],
    "falselist" :
    [
      "فَإِنْ لَمْ يَستَطعْ فَبِلِسَانِهِ",
      "وَذَلِكَ أَضْعَفُ الإيمَانِ",
      "مَن رَأى مِنكُم مُنكَرَاً",
      "فَإِنْ لَمْ يَستَطعْ فَبِقَلبِه",
      "فَليُغَيِّرْهُ بِيَدِهِ",

      ],
  },
   {
    "section" : 4,
    "title" : "عَنْ أَبي هُرَيرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ ﷺ  لاَ تَحَاسَدوا: ",
    "truelist" :
     [
      "وَلاَتَنَاجَشوا",
      "وَلاَ تَبَاغَضوا",
      "وَلاَ تَدَابَروا",
      "وَلاَ يَبِع بَعضُكُم عَلَى بَيعِ بَعضٍ",
      "وَكونوا عِبَادَ اللهِ إِخوَانَاً",
      ],
    "falselist" :
    [
      "وَلاَ تَدَابَروا",
      "وَلاَ تَبَاغَضوا",
      "وَكونوا عِبَادَ اللهِ إِخوَانَاً",
      "وَلاَتَنَاجَشوا",
      "وَلاَ يَبِع بَعضُكُم عَلَى بَيعِ بَعضٍ",
      ],
  },
  
  {
    "section" : 4,
    "title" : "عَنْ أَبي هُرَيرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ ﷺ  المُسلِمُ أَخو المُسلم،:",
    "truelist" :
     [
      "لاَ يَظلِمهُ",
      "وَلاَ يَخذُلُهُ",
      "وَلا يكْذِبُهُ",
      "وَلايَحْقِرُهُ",
      "التَّقوَى هَاهُنَا",
      "وَيُشيرُ إِلَى صَدرِهِ ثَلاَثَ مَراتٍ",
      ],
    "falselist" :
    [
      "وَلايَحْقِرُهُ",
      "وَلاَ يَخذُلُهُ",
      "لاَ يَظلِمهُ",
      "وَلا يكْذِبُهُ",
      "التَّقوَى هَاهُنَا",
      "وَيُشيرُ إِلَى صَدرِهِ ثَلاَثَ مَراتٍ",
      ],
  },
  {
    "section" : 4,
    "title" : "عَنْ أَبي هُرَيرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ ﷺ  بِحَسْبِ امرىء مِن الشَّرِّ:",
    "truelist" :
     [
      "أَن يَحْقِرَ أَخَاهُ المُسلِمَ",
      "كُلُّ المُسِلمِ عَلَى المُسلِمِ",
      "حَرَام ",
      "دَمُهُ ",
      "وَمَالُه ",
      "وَعِرضُه",
      ],
    "falselist" :
    [
      "كُلُّ المُسِلمِ عَلَى المُسلِمِ",
      "حَرَام ",
      "أَن يَحْقِرَ أَخَاهُ المُسلِمَ",
      "دَمُهُ ",
      "وَمَالُه ",
      "وَعِرضُه",
      ],
  },
  {
    "section" : 4,
    "title" : "عَنْ أَبي هُرَيرَة رضي الله عنه عَنِ النبي ﷺ قَالَ: مَنْ نَفَّسَ عَنْ مُؤمِن كُربَةً",
    "truelist" :
     [
      "مِن كُرَبِ الدُّنيَا",
      "نَفَّسَ اللهُ عَنهُ كُربَةً",
      "مِنْ كرَبِ يَوم القيامَةِ",
      "وَمَنْ يَسَّرَ على مُعسرٍ يَسَّرَ الله عَلَيهِ",
      "في الدُّنيَا والآخِرَة",
      "وَمَنْ سَتَرَ مُسلِمَاً سَتَرَهُ الله في الدُّنيَا وَالآخِرَة",
      ],
    "falselist" :
    [
      "مِنْ كرَبِ يَوم القيامَةِ",
      "في الدُّنيَا والآخِرَة",
      "وَمَنْ يَسَّرَ على مُعسرٍ يَسَّرَ الله عَلَيهِ",
      "مِن كُرَبِ الدُّنيَا",
      "وَمَنْ سَتَرَ مُسلِمَاً سَتَرَهُ الله في الدُّنيَا وَالآخِرَة",
      "نَفَّسَ اللهُ عَنهُ كُربَةً",
      ],
  },
  {
    "section" : 4,
    "title" : "وَمَنْ سَلَكَ طَريقَاً يَلتَمِسُ فيهِ عِلمَاً",
    "truelist" :
     [
      "سَهَّلَ اللهُ لهُ بِهِ طَريقَاً إِلَى الجَنَّةِ",
      "وَمَا اجتَمَعَ قَومٌ في بَيتٍ مِنْ بيوتِ اللهِ يَتلونَ كِتابِ اللهِ",
      "وَيتَدارَسونهَ بَينَهُم إِلا نَزَلَت عَلَيهُم السَّكينَة",
      "وَغَشيَتهم الرَّحمَة وحَفَتهُمُ المَلائِكة وَذَكَرهُم اللهُ فيمَن عِندَهُ",
      "وَمَنْ بَطَّأ بِهِ عَمَلُهُ لَمْ يُسْرِعْ",
      "بهِ نَسَبُهُ",
      ],
    "falselist" :
    [
      "سَهَّلَ اللهُ لهُ بِهِ طَريقَاً إِلَى الجَنَّةِ",
      "بهِ نَسَبُهُ",
      "وَيتَدارَسونهَ بَينَهُم إِلا نَزَلَت عَلَيهُم السَّكينَة",
      "وَمَا اجتَمَعَ قَومٌ في بَيتٍ مِنْ بيوتِ اللهِ يَتلونَ كِتابِ اللهِ",
      "وَمَنْ بَطَّأ بِهِ عَمَلُهُ لَمْ يُسْرِعْ",
      "وَغَشيَتهم الرَّحمَة وحَفَتهُمُ المَلائِكة وَذَكَرهُم اللهُ فيمَن عِندَهُ",
      ],
  },
  {
    "section" : 4,
    "title" : "عَن ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا عَنِ النبي ﷺ فِيْمَا يَرْوِيْهِ عَنْ رَبِّهِ تَبَارَكَ وَتَعَالى أَنَّهُ قَالَ: إنَّ الله كَتَبَ الحَسَنَاتِ وَالسَّيئَاتِ ثُمَّ بَيَّنَ ذَلِكَ؛",
    "truelist" :
     [
      " فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا",
      "كَتَبَهَا اللهُ عِنْدَهُ حَسَنَةً كَامِلَةً",
      "وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللهُ عِنْدَهُ عَشْرَ حَسَنَاتٍ",
      "إِلَى سَبْعِمائَةِ ضِعْفٍ",
      "إِلىَ أَضْعَاف كَثِيْرَةٍ",
      "وَإِنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللهُ عِنْدَهُ حَسَنَةً كَامِلَةً",
      "وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللهُ سَيِّئَةً وَاحِدَةً"
      ],
    "falselist" :
    [
      " فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا",
      "إِلَى سَبْعِمائَةِ ضِعْفٍ",
      "وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللهُ سَيِّئَةً وَاحِدَةً",
      "كَتَبَهَا اللهُ عِنْدَهُ حَسَنَةً كَامِلَةً",
      "وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللهُ عِنْدَهُ عَشْرَ حَسَنَاتٍ",
      "وَإِنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللهُ عِنْدَهُ حَسَنَةً كَامِلَةً",
      "إِلىَ أَضْعَاف كَثِيْرَةٍ",
      ],
  },
  {
    "section" : 4,
    "title" : "عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ ﷺ : (إِنَّ اللهَ تَعَالَى قَالَ: مَنْ عَادَى لِي وَلِيَّاً فَقَدْ آذَنْتُهُ بِالحَرْبِ",
    "truelist" :
     [
      "وَمَا تَقَرَّبَ إِلِيَّ عَبْدِيْ بِشَيءٍ",
      "أَحَبَّ إِلِيَّ مِمَّا افْتَرَضْتُ عَلَيْهِ",
      "وما يَزَالُ عَبْدِيْ يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبتُهُ كُنْتُ سَمْعَهُ الَّذِيْ يَسْمَعُ بِهِ",
      "وَبَصَرَهُ الَّذِيْ يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي يَمْشِيْ بِهَا",
      "وَإنْ سَأَلَنِيْ لأُعطِيَنَّهُ",
      "وَلَئِنْ اسْتَعَاذَنِيْ لأُعِيْذَنَّهُ",
      ],
    "falselist" :
    [
      "وَإنْ سَأَلَنِيْ لأُعطِيَنَّهُ",
      "وما يَزَالُ عَبْدِيْ يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبتُهُ كُنْتُ سَمْعَهُ الَّذِيْ يَسْمَعُ بِهِ",
      "وَمَا تَقَرَّبَ إِلِيَّ عَبْدِيْ بِشَيءٍ",
      "وَبَصَرَهُ الَّذِيْ يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي يَمْشِيْ بِهَا",
      "وَلَئِنْ اسْتَعَاذَنِيْ لأُعِيْذَنَّهُ",
      "أَحَبَّ إِلِيَّ مِمَّا افْتَرَضْتُ عَلَيْهِ",
      ],
  },
  {
    "section" : 4,
    "title" : "عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا قَالَ: أَخَذَ رَسُولُ اللهِ ﷺ بِمنْكبيَّ فَقَالَ: كُنْ فِي الدُّنْيَا كَأَنَّكَ",
    "truelist" :
     [
      " غَرِيْبٌ أَوْ عَابِرُ سَبِيْلٍ",
      "وَكَانَ ابْنُ عُمَرَ رَضِيَ اللهُ عَنْهُمَا يَقُوْلُ:",
      "إِذَا أَمْسَيْتَ فَلا تَنْتَظِرِ الصَّبَاحَ،",
      "وَإِذَا أَصْبَحْتَ فَلا تَنْتَظِرِ المَسَاءَ",
      "وَخُذْ مِنْ صِحَّتِكَ لِمَرَضِكَ",
      "ومِنْ حَيَاتِكَ لمَوْتِكَ",
      ],
    "falselist" :
    [
      "وَكَانَ ابْنُ عُمَرَ رَضِيَ اللهُ عَنْهُمَا يَقُوْلُ:",
      "وَإِذَا أَصْبَحْتَ فَلا تَنْتَظِرِ المَسَاءَ",
      "وَخُذْ مِنْ صِحَّتِكَ لِمَرَضِكَ",
      " غَرِيْبٌ أَوْ عَابِرُ سَبِيْلٍ",
      "إِذَا أَمْسَيْتَ فَلا تَنْتَظِرِ الصَّبَاحَ،",
      "ومِنْ حَيَاتِكَ لمَوْتِكَ",
      ],
  },
  {
    "section" : 4,
    "title" : "عَنْ أَبِيْ مُحَمَّدٍ عَبْدِ اللهِ بِنِ عمْرِو بْنِ العَاصِ رَضِيَ اللهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللهِ صلى الله عليه وسلم: لاَيُؤْمِنُ أَحَدُكُمْ ",
    "truelist" :
     [
      "حَتَّى يَكُونَ",
      "هَواهُ",
      "تَبَعَاً لِمَا",
      "جِئْتُ ",
      "بِهِ",
      ],
    "falselist" :
    [
      "هَواهُ",
      "تَبَعَاً لِمَا",
      "بِهِ",
      "حَتَّى يَكُونَ",
      "جِئْتُ ",
      ],
  },
  {
    "section" : 4,
    "title" : "عَنْ أَنَسِ بْنِ مَالِكٍ رضي الله عنه قَالَ: سَمِعْتُ رَسُولَ اللهِ يَقُولُ: قَالَ اللهُ تَعَالَى: يَا ابْنَ آَدَمَ إِنَّكَ مَا دَعَوتَنِيْ وَرَجَوتَنِيْ ",
    "truelist" :
     [
      "غَفَرْتُ لَكَ عَلَى مَا كَانَ مِنْكَ",
      "وَلا أُبَالِيْ",
      "يَا ابْنَ آَدَمَ لَو بَلَغَتْ ذُنُوبُكَ عَنَانَ السَّمَاءِ ثُمَّ استَغْفَرْتَنِيْ",
      "غَفَرْتُ لَكَ",
      "يَا ابْنَ آَدَمَ إِنَّكَ لَو أَتَيْتَنِيْ بِقُرَابِ الأَرْضِ خَطَايَا",
      "ثُمَّ لقِيْتَنِيْ لاَ تُشْرِك بِيْ شَيْئَاً لأَتَيْتُكَ بِقُرَابِهَا مَغفِرَةً",
      ],
    "falselist" :
    [
      "يَا ابْنَ آَدَمَ إِنَّكَ لَو أَتَيْتَنِيْ بِقُرَابِ الأَرْضِ خَطَايَا",
      "وَلا أُبَالِيْ",
      "غَفَرْتُ لَكَ",
      "غَفَرْتُ لَكَ عَلَى مَا كَانَ مِنْكَ",
      "يَا ابْنَ آَدَمَ لَو بَلَغَتْ ذُنُوبُكَ عَنَانَ السَّمَاءِ ثُمَّ استَغْفَرْتَنِيْ",
      "ثُمَّ لقِيْتَنِيْ لاَ تُشْرِك بِيْ شَيْئَاً لأَتَيْتُكَ بِقُرَابِهَا مَغفِرَةً",
      ],
  },

  {
    "section" : 4,
    "title" : "عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا أَنَّ رَسُولَ اللهِ ﷺ قَال: إِنَّ اللهَ تَجَاوَزَ لِي",
    "truelist" :
     [
      "عَنْ أُمَّتِي",
      "الخَطَأَ ",
      "وَالنِّسْيَانَ",
      "وَمَا اسْتُكْرِهُوا",
      "عَلَيْهِ",
      ],
    "falselist" :
    [
      "عَنْ أُمَّتِي",
      "عَلَيْهِ",
      "الخَطَأَ ",
      "وَمَا اسْتُكْرِهُوا",
      "وَالنِّسْيَانَ",
      ],
  },
  
  


];
